zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q21.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* ========== PIO definition for AFEC0 peripheral ========== */
#define PIN_PA8B_AFEC0_ADTRG                       8L           /**< AFEC0 signal: ADTRG on PA8 mux B*/
#define MUX_PA8B_AFEC0_ADTRG                       1L          
#define PINMUX_PA8B_AFEC0_ADTRG                    ((PIN_PA8B_AFEC0_ADTRG << 16) | MUX_PA8B_AFEC0_ADTRG)
#define PIO_PA8B_AFEC0_ADTRG                       (1UL << 8)  

/* ========== PIO definition for AFEC1 peripheral ========== */
#define PIN_PD9C_AFEC1_ADTRG                       105L         /**< AFEC1 signal: ADTRG on PD9 mux C*/
#define MUX_PD9C_AFEC1_ADTRG                       2L          
#define PINMUX_PD9C_AFEC1_ADTRG                    ((PIN_PD9C_AFEC1_ADTRG << 16) | MUX_PD9C_AFEC1_ADTRG)
#define PIO_PD9C_AFEC1_ADTRG                       (1UL << 9)  

/* ========== PIO definition for DACC peripheral ========== */
#define PIN_PA2C_DACC_DATRG                        2L           /**< DACC signal: DATRG on PA2 mux C*/
#define MUX_PA2C_DACC_DATRG                        2L          
#define PINMUX_PA2C_DACC_DATRG                     ((PIN_PA2C_DACC_DATRG << 16) | MUX_PA2C_DACC_DATRG)
#define PIO_PA2C_DACC_DATRG                        (1UL << 2)  

/* ========== PIO definition for GMAC peripheral ========== */
#define PIN_PD13A_GMAC_GCOL                        109L         /**< GMAC signal: GCOL on PD13 mux A*/
#define MUX_PD13A_GMAC_GCOL                        0L          
#define PINMUX_PD13A_GMAC_GCOL                     ((PIN_PD13A_GMAC_GCOL << 16) | MUX_PD13A_GMAC_GCOL)
#define PIO_PD13A_GMAC_GCOL                        (1UL << 13) 

#define PIN_PD10A_GMAC_GCRS                        106L         /**< GMAC signal: GCRS on PD10 mux A*/
#define MUX_PD10A_GMAC_GCRS                        0L          
#define PINMUX_PD10A_GMAC_GCRS                     ((PIN_PD10A_GMAC_GCRS << 16) | MUX_PD10A_GMAC_GCRS)
#define PIO_PD10A_GMAC_GCRS                        (1UL << 10) 

#define PIN_PD8A_GMAC_GMDC                         104L         /**< GMAC signal: GMDC on PD8 mux A*/
#define MUX_PD8A_GMAC_GMDC                         0L          
#define PINMUX_PD8A_GMAC_GMDC                      ((PIN_PD8A_GMAC_GMDC << 16) | MUX_PD8A_GMAC_GMDC)
#define PIO_PD8A_GMAC_GMDC                         (1UL << 8)  

#define PIN_PD9A_GMAC_GMDIO                        105L         /**< GMAC signal: GMDIO on PD9 mux A*/
#define MUX_PD9A_GMAC_GMDIO                        0L          
#define PINMUX_PD9A_GMAC_GMDIO                     ((PIN_PD9A_GMAC_GMDIO << 16) | MUX_PD9A_GMAC_GMDIO)
#define PIO_PD9A_GMAC_GMDIO                        (1UL << 9)  

#define PIN_PD14A_GMAC_GRXCK                       110L         /**< GMAC signal: GRXCK on PD14 mux A*/
#define MUX_PD14A_GMAC_GRXCK                       0L          
#define PINMUX_PD14A_GMAC_GRXCK                    ((PIN_PD14A_GMAC_GRXCK << 16) | MUX_PD14A_GMAC_GRXCK)
#define PIO_PD14A_GMAC_GRXCK                       (1UL << 14) 

#define PIN_PD4A_GMAC_GRXDV                        100L         /**< GMAC signal: GRXDV on PD4 mux A*/
#define MUX_PD4A_GMAC_GRXDV                        0L          
#define PINMUX_PD4A_GMAC_GRXDV                     ((PIN_PD4A_GMAC_GRXDV << 16) | MUX_PD4A_GMAC_GRXDV)
#define PIO_PD4A_GMAC_GRXDV                        (1UL << 4)  

#define PIN_PD7A_GMAC_GRXER                        103L         /**< GMAC signal: GRXER on PD7 mux A*/
#define MUX_PD7A_GMAC_GRXER                        0L          
#define PINMUX_PD7A_GMAC_GRXER                     ((PIN_PD7A_GMAC_GRXER << 16) | MUX_PD7A_GMAC_GRXER)
#define PIO_PD7A_GMAC_GRXER                        (1UL << 7)  

#define PIN_PD5A_GMAC_GRX0                         101L         /**< GMAC signal: GRX0 on PD5 mux A*/
#define MUX_PD5A_GMAC_GRX0                         0L          
#define PINMUX_PD5A_GMAC_GRX0                      ((PIN_PD5A_GMAC_GRX0 << 16) | MUX_PD5A_GMAC_GRX0)
#define PIO_PD5A_GMAC_GRX0                         (1UL << 5)  

#define PIN_PD6A_GMAC_GRX1                         102L         /**< GMAC signal: GRX1 on PD6 mux A*/
#define MUX_PD6A_GMAC_GRX1                         0L          
#define PINMUX_PD6A_GMAC_GRX1                      ((PIN_PD6A_GMAC_GRX1 << 16) | MUX_PD6A_GMAC_GRX1)
#define PIO_PD6A_GMAC_GRX1                         (1UL << 6)  

#define PIN_PD11A_GMAC_GRX2                        107L         /**< GMAC signal: GRX2 on PD11 mux A*/
#define MUX_PD11A_GMAC_GRX2                        0L          
#define PINMUX_PD11A_GMAC_GRX2                     ((PIN_PD11A_GMAC_GRX2 << 16) | MUX_PD11A_GMAC_GRX2)
#define PIO_PD11A_GMAC_GRX2                        (1UL << 11) 

#define PIN_PD12A_GMAC_GRX3                        108L         /**< GMAC signal: GRX3 on PD12 mux A*/
#define MUX_PD12A_GMAC_GRX3                        0L          
#define PINMUX_PD12A_GMAC_GRX3                     ((PIN_PD12A_GMAC_GRX3 << 16) | MUX_PD12A_GMAC_GRX3)
#define PIO_PD12A_GMAC_GRX3                        (1UL << 12) 

#define PIN_PB1B_GMAC_GTSUCOMP                     33L          /**< GMAC signal: GTSUCOMP on PB1 mux B*/
#define MUX_PB1B_GMAC_GTSUCOMP                     1L          
#define PINMUX_PB1B_GMAC_GTSUCOMP                  ((PIN_PB1B_GMAC_GTSUCOMP << 16) | MUX_PB1B_GMAC_GTSUCOMP)
#define PIO_PB1B_GMAC_GTSUCOMP                     (1UL << 1)  

#define PIN_PB12B_GMAC_GTSUCOMP                    44L          /**< GMAC signal: GTSUCOMP on PB12 mux B*/
#define MUX_PB12B_GMAC_GTSUCOMP                    1L          
#define PINMUX_PB12B_GMAC_GTSUCOMP                 ((PIN_PB12B_GMAC_GTSUCOMP << 16) | MUX_PB12B_GMAC_GTSUCOMP)
#define PIO_PB12B_GMAC_GTSUCOMP                    (1UL << 12) 

#define PIN_PD11C_GMAC_GTSUCOMP                    107L         /**< GMAC signal: GTSUCOMP on PD11 mux C*/
#define MUX_PD11C_GMAC_GTSUCOMP                    2L          
#define PINMUX_PD11C_GMAC_GTSUCOMP                 ((PIN_PD11C_GMAC_GTSUCOMP << 16) | MUX_PD11C_GMAC_GTSUCOMP)
#define PIO_PD11C_GMAC_GTSUCOMP                    (1UL << 11) 

#define PIN_PD20C_GMAC_GTSUCOMP                    116L         /**< GMAC signal: GTSUCOMP on PD20 mux C*/
#define MUX_PD20C_GMAC_GTSUCOMP                    2L          
#define PINMUX_PD20C_GMAC_GTSUCOMP                 ((PIN_PD20C_GMAC_GTSUCOMP << 16) | MUX_PD20C_GMAC_GTSUCOMP)
#define PIO_PD20C_GMAC_GTSUCOMP                    (1UL << 20) 

