zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q21.h
#define PIN_PD0A_GMAC_GTXCK                        96L          /**< GMAC signal: GTXCK on PD0 mux A*/
#define MUX_PD0A_GMAC_GTXCK                        0L          
#define PINMUX_PD0A_GMAC_GTXCK                     ((PIN_PD0A_GMAC_GTXCK << 16) | MUX_PD0A_GMAC_GTXCK)
#define PIO_PD0A_GMAC_GTXCK                        (1UL << 0)  

#define PIN_PD1A_GMAC_GTXEN                        97L          /**< GMAC signal: GTXEN on PD1 mux A*/
#define MUX_PD1A_GMAC_GTXEN                        0L          
#define PINMUX_PD1A_GMAC_GTXEN                     ((PIN_PD1A_GMAC_GTXEN << 16) | MUX_PD1A_GMAC_GTXEN)
#define PIO_PD1A_GMAC_GTXEN                        (1UL << 1)  

#define PIN_PD17A_GMAC_GTXER                       113L         /**< GMAC signal: GTXER on PD17 mux A*/
#define MUX_PD17A_GMAC_GTXER                       0L          
#define PINMUX_PD17A_GMAC_GTXER                    ((PIN_PD17A_GMAC_GTXER << 16) | MUX_PD17A_GMAC_GTXER)
#define PIO_PD17A_GMAC_GTXER                       (1UL << 17) 

#define PIN_PD2A_GMAC_GTX0                         98L          /**< GMAC signal: GTX0 on PD2 mux A*/
#define MUX_PD2A_GMAC_GTX0                         0L          
#define PINMUX_PD2A_GMAC_GTX0                      ((PIN_PD2A_GMAC_GTX0 << 16) | MUX_PD2A_GMAC_GTX0)
#define PIO_PD2A_GMAC_GTX0                         (1UL << 2)  

#define PIN_PD3A_GMAC_GTX1                         99L          /**< GMAC signal: GTX1 on PD3 mux A*/
#define MUX_PD3A_GMAC_GTX1                         0L          
#define PINMUX_PD3A_GMAC_GTX1                      ((PIN_PD3A_GMAC_GTX1 << 16) | MUX_PD3A_GMAC_GTX1)
#define PIO_PD3A_GMAC_GTX1                         (1UL << 3)  

#define PIN_PD15A_GMAC_GTX2                        111L         /**< GMAC signal: GTX2 on PD15 mux A*/
#define MUX_PD15A_GMAC_GTX2                        0L          
#define PINMUX_PD15A_GMAC_GTX2                     ((PIN_PD15A_GMAC_GTX2 << 16) | MUX_PD15A_GMAC_GTX2)
#define PIO_PD15A_GMAC_GTX2                        (1UL << 15) 

#define PIN_PD16A_GMAC_GTX3                        112L         /**< GMAC signal: GTX3 on PD16 mux A*/
#define MUX_PD16A_GMAC_GTX3                        0L          
#define PINMUX_PD16A_GMAC_GTX3                     ((PIN_PD16A_GMAC_GTX3 << 16) | MUX_PD16A_GMAC_GTX3)
#define PIO_PD16A_GMAC_GTX3                        (1UL << 16) 

/* ========== PIO definition for HSMCI peripheral ========== */
#define PIN_PA28C_HSMCI_MCCDA                      28L          /**< HSMCI signal: MCCDA on PA28 mux C*/
#define MUX_PA28C_HSMCI_MCCDA                      2L          
#define PINMUX_PA28C_HSMCI_MCCDA                   ((PIN_PA28C_HSMCI_MCCDA << 16) | MUX_PA28C_HSMCI_MCCDA)
#define PIO_PA28C_HSMCI_MCCDA                      (1UL << 28) 

#define PIN_PA25D_HSMCI_MCCK                       25L          /**< HSMCI signal: MCCK on PA25 mux D*/
#define MUX_PA25D_HSMCI_MCCK                       3L          
#define PINMUX_PA25D_HSMCI_MCCK                    ((PIN_PA25D_HSMCI_MCCK << 16) | MUX_PA25D_HSMCI_MCCK)
#define PIO_PA25D_HSMCI_MCCK                       (1UL << 25) 

#define PIN_PA30C_HSMCI_MCDA0                      30L          /**< HSMCI signal: MCDA0 on PA30 mux C*/
#define MUX_PA30C_HSMCI_MCDA0                      2L          
#define PINMUX_PA30C_HSMCI_MCDA0                   ((PIN_PA30C_HSMCI_MCDA0 << 16) | MUX_PA30C_HSMCI_MCDA0)
#define PIO_PA30C_HSMCI_MCDA0                      (1UL << 30) 

#define PIN_PA31C_HSMCI_MCDA1                      31L          /**< HSMCI signal: MCDA1 on PA31 mux C*/
#define MUX_PA31C_HSMCI_MCDA1                      2L          
#define PINMUX_PA31C_HSMCI_MCDA1                   ((PIN_PA31C_HSMCI_MCDA1 << 16) | MUX_PA31C_HSMCI_MCDA1)
#define PIO_PA31C_HSMCI_MCDA1                      (1UL << 31) 

#define PIN_PA26C_HSMCI_MCDA2                      26L          /**< HSMCI signal: MCDA2 on PA26 mux C*/
#define MUX_PA26C_HSMCI_MCDA2                      2L          
#define PINMUX_PA26C_HSMCI_MCDA2                   ((PIN_PA26C_HSMCI_MCDA2 << 16) | MUX_PA26C_HSMCI_MCDA2)
#define PIO_PA26C_HSMCI_MCDA2                      (1UL << 26) 

#define PIN_PA27C_HSMCI_MCDA3                      27L          /**< HSMCI signal: MCDA3 on PA27 mux C*/
#define MUX_PA27C_HSMCI_MCDA3                      2L          
#define PINMUX_PA27C_HSMCI_MCDA3                   ((PIN_PA27C_HSMCI_MCDA3 << 16) | MUX_PA27C_HSMCI_MCDA3)
#define PIO_PA27C_HSMCI_MCDA3                      (1UL << 27) 

/* ========== PIO definition for ISI peripheral ========== */
#define PIN_PD22D_ISI_D0                           118L         /**< ISI signal: D0 on PD22 mux D*/
#define MUX_PD22D_ISI_D0                           3L          
#define PINMUX_PD22D_ISI_D0                        ((PIN_PD22D_ISI_D0 << 16) | MUX_PD22D_ISI_D0)
#define PIO_PD22D_ISI_D0                           (1UL << 22) 

#define PIN_PD21D_ISI_D1                           117L         /**< ISI signal: D1 on PD21 mux D*/
#define MUX_PD21D_ISI_D1                           3L          
#define PINMUX_PD21D_ISI_D1                        ((PIN_PD21D_ISI_D1 << 16) | MUX_PD21D_ISI_D1)
#define PIO_PD21D_ISI_D1                           (1UL << 21) 

#define PIN_PB3D_ISI_D2                            35L          /**< ISI signal: D2 on PB3 mux D*/
#define MUX_PB3D_ISI_D2                            3L          
#define PINMUX_PB3D_ISI_D2                         ((PIN_PB3D_ISI_D2 << 16) | MUX_PB3D_ISI_D2)
#define PIO_PB3D_ISI_D2                            (1UL << 3)  

#define PIN_PA9B_ISI_D3                            9L           /**< ISI signal: D3 on PA9 mux B*/
#define MUX_PA9B_ISI_D3                            1L          
#define PINMUX_PA9B_ISI_D3                         ((PIN_PA9B_ISI_D3 << 16) | MUX_PA9B_ISI_D3)
#define PIO_PA9B_ISI_D3                            (1UL << 9)  

#define PIN_PA5B_ISI_D4                            5L           /**< ISI signal: D4 on PA5 mux B*/
#define MUX_PA5B_ISI_D4                            1L          
#define PINMUX_PA5B_ISI_D4                         ((PIN_PA5B_ISI_D4 << 16) | MUX_PA5B_ISI_D4)
#define PIO_PA5B_ISI_D4                            (1UL << 5)  

#define PIN_PD11D_ISI_D5                           107L         /**< ISI signal: D5 on PD11 mux D*/
#define MUX_PD11D_ISI_D5                           3L          
#define PINMUX_PD11D_ISI_D5                        ((PIN_PD11D_ISI_D5 << 16) | MUX_PD11D_ISI_D5)
#define PIO_PD11D_ISI_D5                           (1UL << 11) 

#define PIN_PD12D_ISI_D6                           108L         /**< ISI signal: D6 on PD12 mux D*/
#define MUX_PD12D_ISI_D6                           3L          
#define PINMUX_PD12D_ISI_D6                        ((PIN_PD12D_ISI_D6 << 16) | MUX_PD12D_ISI_D6)
#define PIO_PD12D_ISI_D6                           (1UL << 12) 

