zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q21.h
#define PIN_PD2B_PWM1_PWML1                        98L          /**< PWM1 signal: PWML1 on PD2 mux B*/
#define MUX_PD2B_PWM1_PWML1                        1L          
#define PINMUX_PD2B_PWM1_PWML1                     ((PIN_PD2B_PWM1_PWML1 << 16) | MUX_PD2B_PWM1_PWML1)
#define PIO_PD2B_PWM1_PWML1                        (1UL << 2)  

#define PIN_PA23D_PWM1_PWML2                       23L          /**< PWM1 signal: PWML2 on PA23 mux D*/
#define MUX_PA23D_PWM1_PWML2                       3L          
#define PINMUX_PA23D_PWM1_PWML2                    ((PIN_PA23D_PWM1_PWML2 << 16) | MUX_PA23D_PWM1_PWML2)
#define PIO_PA23D_PWM1_PWML2                       (1UL << 23) 

#define PIN_PD4B_PWM1_PWML2                        100L         /**< PWM1 signal: PWML2 on PD4 mux B*/
#define MUX_PD4B_PWM1_PWML2                        1L          
#define PINMUX_PD4B_PWM1_PWML2                     ((PIN_PD4B_PWM1_PWML2 << 16) | MUX_PD4B_PWM1_PWML2)
#define PIO_PD4B_PWM1_PWML2                        (1UL << 4)  

#define PIN_PA5A_PWM1_PWML3                        5L           /**< PWM1 signal: PWML3 on PA5 mux A*/
#define MUX_PA5A_PWM1_PWML3                        0L          
#define PINMUX_PA5A_PWM1_PWML3                     ((PIN_PA5A_PWM1_PWML3 << 16) | MUX_PA5A_PWM1_PWML3)
#define PIO_PA5A_PWM1_PWML3                        (1UL << 5)  

#define PIN_PD6B_PWM1_PWML3                        102L         /**< PWM1 signal: PWML3 on PD6 mux B*/
#define MUX_PD6B_PWM1_PWML3                        1L          
#define PINMUX_PD6B_PWM1_PWML3                     ((PIN_PD6B_PWM1_PWML3 << 16) | MUX_PD6B_PWM1_PWML3)
#define PIO_PD6B_PWM1_PWML3                        (1UL << 6)  

/* ========== PIO definition for QSPI peripheral ========== */
#define PIN_PA11A_QSPI_QCS                         11L          /**< QSPI signal: QCS on PA11 mux A*/
#define MUX_PA11A_QSPI_QCS                         0L          
#define PINMUX_PA11A_QSPI_QCS                      ((PIN_PA11A_QSPI_QCS << 16) | MUX_PA11A_QSPI_QCS)
#define PIO_PA11A_QSPI_QCS                         (1UL << 11) 

#define PIN_PA13A_QSPI_QIO0                        13L          /**< QSPI signal: QIO0 on PA13 mux A*/
#define MUX_PA13A_QSPI_QIO0                        0L          
#define PINMUX_PA13A_QSPI_QIO0                     ((PIN_PA13A_QSPI_QIO0 << 16) | MUX_PA13A_QSPI_QIO0)
#define PIO_PA13A_QSPI_QIO0                        (1UL << 13) 

#define PIN_PA12A_QSPI_QIO1                        12L          /**< QSPI signal: QIO1 on PA12 mux A*/
#define MUX_PA12A_QSPI_QIO1                        0L          
#define PINMUX_PA12A_QSPI_QIO1                     ((PIN_PA12A_QSPI_QIO1 << 16) | MUX_PA12A_QSPI_QIO1)
#define PIO_PA12A_QSPI_QIO1                        (1UL << 12) 

#define PIN_PA17A_QSPI_QIO2                        17L          /**< QSPI signal: QIO2 on PA17 mux A*/
#define MUX_PA17A_QSPI_QIO2                        0L          
#define PINMUX_PA17A_QSPI_QIO2                     ((PIN_PA17A_QSPI_QIO2 << 16) | MUX_PA17A_QSPI_QIO2)
#define PIO_PA17A_QSPI_QIO2                        (1UL << 17) 

#define PIN_PD31A_QSPI_QIO3                        127L         /**< QSPI signal: QIO3 on PD31 mux A*/
#define MUX_PD31A_QSPI_QIO3                        0L          
#define PINMUX_PD31A_QSPI_QIO3                     ((PIN_PD31A_QSPI_QIO3 << 16) | MUX_PD31A_QSPI_QIO3)
#define PIO_PD31A_QSPI_QIO3                        (1UL << 31) 

#define PIN_PA14A_QSPI_QSCK                        14L          /**< QSPI signal: QSCK on PA14 mux A*/
#define MUX_PA14A_QSPI_QSCK                        0L          
#define PINMUX_PA14A_QSPI_QSCK                     ((PIN_PA14A_QSPI_QSCK << 16) | MUX_PA14A_QSPI_QSCK)
#define PIO_PA14A_QSPI_QSCK                        (1UL << 14) 

/* ========== PIO definition for SDRAMC peripheral ========== */
#define PIN_PC18A_SDRAMC_A0                        82L          /**< SDRAMC signal: A0 on PC18 mux A*/
#define MUX_PC18A_SDRAMC_A0                        0L          
#define PINMUX_PC18A_SDRAMC_A0                     ((PIN_PC18A_SDRAMC_A0 << 16) | MUX_PC18A_SDRAMC_A0)
#define PIO_PC18A_SDRAMC_A0                        (1UL << 18) 

#define PIN_PC18A_SDRAMC_NBS0                      82L          /**< SDRAMC signal: NBS0 on PC18 mux A*/
#define MUX_PC18A_SDRAMC_NBS0                      0L          
#define PINMUX_PC18A_SDRAMC_NBS0                   ((PIN_PC18A_SDRAMC_NBS0 << 16) | MUX_PC18A_SDRAMC_NBS0)
#define PIO_PC18A_SDRAMC_NBS0                      (1UL << 18) 

#define PIN_PC19A_SDRAMC_A1                        83L          /**< SDRAMC signal: A1 on PC19 mux A*/
#define MUX_PC19A_SDRAMC_A1                        0L          
#define PINMUX_PC19A_SDRAMC_A1                     ((PIN_PC19A_SDRAMC_A1 << 16) | MUX_PC19A_SDRAMC_A1)
#define PIO_PC19A_SDRAMC_A1                        (1UL << 19) 

#define PIN_PC20A_SDRAMC_A2                        84L          /**< SDRAMC signal: A2 on PC20 mux A*/
#define MUX_PC20A_SDRAMC_A2                        0L          
#define PINMUX_PC20A_SDRAMC_A2                     ((PIN_PC20A_SDRAMC_A2 << 16) | MUX_PC20A_SDRAMC_A2)
#define PIO_PC20A_SDRAMC_A2                        (1UL << 20) 

#define PIN_PC21A_SDRAMC_A3                        85L          /**< SDRAMC signal: A3 on PC21 mux A*/
#define MUX_PC21A_SDRAMC_A3                        0L          
#define PINMUX_PC21A_SDRAMC_A3                     ((PIN_PC21A_SDRAMC_A3 << 16) | MUX_PC21A_SDRAMC_A3)
#define PIO_PC21A_SDRAMC_A3                        (1UL << 21) 

#define PIN_PC22A_SDRAMC_A4                        86L          /**< SDRAMC signal: A4 on PC22 mux A*/
#define MUX_PC22A_SDRAMC_A4                        0L          
#define PINMUX_PC22A_SDRAMC_A4                     ((PIN_PC22A_SDRAMC_A4 << 16) | MUX_PC22A_SDRAMC_A4)
#define PIO_PC22A_SDRAMC_A4                        (1UL << 22) 

#define PIN_PC23A_SDRAMC_A5                        87L          /**< SDRAMC signal: A5 on PC23 mux A*/
#define MUX_PC23A_SDRAMC_A5                        0L          
#define PINMUX_PC23A_SDRAMC_A5                     ((PIN_PC23A_SDRAMC_A5 << 16) | MUX_PC23A_SDRAMC_A5)
#define PIO_PC23A_SDRAMC_A5                        (1UL << 23) 

