zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q21.h
#define PIN_PC24A_SDRAMC_A6                        88L          /**< SDRAMC signal: A6 on PC24 mux A*/
#define MUX_PC24A_SDRAMC_A6                        0L          
#define PINMUX_PC24A_SDRAMC_A6                     ((PIN_PC24A_SDRAMC_A6 << 16) | MUX_PC24A_SDRAMC_A6)
#define PIO_PC24A_SDRAMC_A6                        (1UL << 24) 

#define PIN_PC25A_SDRAMC_A7                        89L          /**< SDRAMC signal: A7 on PC25 mux A*/
#define MUX_PC25A_SDRAMC_A7                        0L          
#define PINMUX_PC25A_SDRAMC_A7                     ((PIN_PC25A_SDRAMC_A7 << 16) | MUX_PC25A_SDRAMC_A7)
#define PIO_PC25A_SDRAMC_A7                        (1UL << 25) 

#define PIN_PC26A_SDRAMC_A8                        90L          /**< SDRAMC signal: A8 on PC26 mux A*/
#define MUX_PC26A_SDRAMC_A8                        0L          
#define PINMUX_PC26A_SDRAMC_A8                     ((PIN_PC26A_SDRAMC_A8 << 16) | MUX_PC26A_SDRAMC_A8)
#define PIO_PC26A_SDRAMC_A8                        (1UL << 26) 

#define PIN_PC27A_SDRAMC_A9                        91L          /**< SDRAMC signal: A9 on PC27 mux A*/
#define MUX_PC27A_SDRAMC_A9                        0L          
#define PINMUX_PC27A_SDRAMC_A9                     ((PIN_PC27A_SDRAMC_A9 << 16) | MUX_PC27A_SDRAMC_A9)
#define PIO_PC27A_SDRAMC_A9                        (1UL << 27) 

#define PIN_PC28A_SDRAMC_A10                       92L          /**< SDRAMC signal: A10 on PC28 mux A*/
#define MUX_PC28A_SDRAMC_A10                       0L          
#define PINMUX_PC28A_SDRAMC_A10                    ((PIN_PC28A_SDRAMC_A10 << 16) | MUX_PC28A_SDRAMC_A10)
#define PIO_PC28A_SDRAMC_A10                       (1UL << 28) 

#define PIN_PC29A_SDRAMC_A11                       93L          /**< SDRAMC signal: A11 on PC29 mux A*/
#define MUX_PC29A_SDRAMC_A11                       0L          
#define PINMUX_PC29A_SDRAMC_A11                    ((PIN_PC29A_SDRAMC_A11 << 16) | MUX_PC29A_SDRAMC_A11)
#define PIO_PC29A_SDRAMC_A11                       (1UL << 29) 

#define PIN_PC30A_SDRAMC_A12                       94L          /**< SDRAMC signal: A12 on PC30 mux A*/
#define MUX_PC30A_SDRAMC_A12                       0L          
#define PINMUX_PC30A_SDRAMC_A12                    ((PIN_PC30A_SDRAMC_A12 << 16) | MUX_PC30A_SDRAMC_A12)
#define PIO_PC30A_SDRAMC_A12                       (1UL << 30) 

#define PIN_PC31A_SDRAMC_A13                       95L          /**< SDRAMC signal: A13 on PC31 mux A*/
#define MUX_PC31A_SDRAMC_A13                       0L          
#define PINMUX_PC31A_SDRAMC_A13                    ((PIN_PC31A_SDRAMC_A13 << 16) | MUX_PC31A_SDRAMC_A13)
#define PIO_PC31A_SDRAMC_A13                       (1UL << 31) 

#define PIN_PA18C_SDRAMC_A14                       18L          /**< SDRAMC signal: A14 on PA18 mux C*/
#define MUX_PA18C_SDRAMC_A14                       2L          
#define PINMUX_PA18C_SDRAMC_A14                    ((PIN_PA18C_SDRAMC_A14 << 16) | MUX_PA18C_SDRAMC_A14)
#define PIO_PA18C_SDRAMC_A14                       (1UL << 18) 

#define PIN_PA19C_SDRAMC_A15                       19L          /**< SDRAMC signal: A15 on PA19 mux C*/
#define MUX_PA19C_SDRAMC_A15                       2L          
#define PINMUX_PA19C_SDRAMC_A15                    ((PIN_PA19C_SDRAMC_A15 << 16) | MUX_PA19C_SDRAMC_A15)
#define PIO_PA19C_SDRAMC_A15                       (1UL << 19) 

#define PIN_PA20C_SDRAMC_A16                       20L          /**< SDRAMC signal: A16 on PA20 mux C*/
#define MUX_PA20C_SDRAMC_A16                       2L          
#define PINMUX_PA20C_SDRAMC_A16                    ((PIN_PA20C_SDRAMC_A16 << 16) | MUX_PA20C_SDRAMC_A16)
#define PIO_PA20C_SDRAMC_A16                       (1UL << 20) 

#define PIN_PA20C_SDRAMC_BA0                       20L          /**< SDRAMC signal: BA0 on PA20 mux C*/
#define MUX_PA20C_SDRAMC_BA0                       2L          
#define PINMUX_PA20C_SDRAMC_BA0                    ((PIN_PA20C_SDRAMC_BA0 << 16) | MUX_PA20C_SDRAMC_BA0)
#define PIO_PA20C_SDRAMC_BA0                       (1UL << 20) 

#define PIN_PA0C_SDRAMC_A17                        0L           /**< SDRAMC signal: A17 on PA0 mux C*/
#define MUX_PA0C_SDRAMC_A17                        2L          
#define PINMUX_PA0C_SDRAMC_A17                     ((PIN_PA0C_SDRAMC_A17 << 16) | MUX_PA0C_SDRAMC_A17)
#define PIO_PA0C_SDRAMC_A17                        (1UL << 0)  

#define PIN_PA0C_SDRAMC_BA1                        0L           /**< SDRAMC signal: BA1 on PA0 mux C*/
#define MUX_PA0C_SDRAMC_BA1                        2L          
#define PINMUX_PA0C_SDRAMC_BA1                     ((PIN_PA0C_SDRAMC_BA1 << 16) | MUX_PA0C_SDRAMC_BA1)
#define PIO_PA0C_SDRAMC_BA1                        (1UL << 0)  

#define PIN_PA1C_SDRAMC_A18                        1L           /**< SDRAMC signal: A18 on PA1 mux C*/
#define MUX_PA1C_SDRAMC_A18                        2L          
#define PINMUX_PA1C_SDRAMC_A18                     ((PIN_PA1C_SDRAMC_A18 << 16) | MUX_PA1C_SDRAMC_A18)
#define PIO_PA1C_SDRAMC_A18                        (1UL << 1)  

#define PIN_PA23C_SDRAMC_A19                       23L          /**< SDRAMC signal: A19 on PA23 mux C*/
#define MUX_PA23C_SDRAMC_A19                       2L          
#define PINMUX_PA23C_SDRAMC_A19                    ((PIN_PA23C_SDRAMC_A19 << 16) | MUX_PA23C_SDRAMC_A19)
#define PIO_PA23C_SDRAMC_A19                       (1UL << 23) 

#define PIN_PA24C_SDRAMC_A20                       24L          /**< SDRAMC signal: A20 on PA24 mux C*/
#define MUX_PA24C_SDRAMC_A20                       2L          
#define PINMUX_PA24C_SDRAMC_A20                    ((PIN_PA24C_SDRAMC_A20 << 16) | MUX_PA24C_SDRAMC_A20)
#define PIO_PA24C_SDRAMC_A20                       (1UL << 24) 

#define PIN_PC16A_SDRAMC_A21                       80L          /**< SDRAMC signal: A21 on PC16 mux A*/
#define MUX_PC16A_SDRAMC_A21                       0L          
#define PINMUX_PC16A_SDRAMC_A21                    ((PIN_PC16A_SDRAMC_A21 << 16) | MUX_PC16A_SDRAMC_A21)
#define PIO_PC16A_SDRAMC_A21                       (1UL << 16) 

