zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q21.h
#define PIN_PC16A_SDRAMC_NANDALE                   80L          /**< SDRAMC signal: NANDALE on PC16 mux A*/
#define MUX_PC16A_SDRAMC_NANDALE                   0L          
#define PINMUX_PC16A_SDRAMC_NANDALE                ((PIN_PC16A_SDRAMC_NANDALE << 16) | MUX_PC16A_SDRAMC_NANDALE)
#define PIO_PC16A_SDRAMC_NANDALE                   (1UL << 16) 

#define PIN_PC17A_SDRAMC_A22                       81L          /**< SDRAMC signal: A22 on PC17 mux A*/
#define MUX_PC17A_SDRAMC_A22                       0L          
#define PINMUX_PC17A_SDRAMC_A22                    ((PIN_PC17A_SDRAMC_A22 << 16) | MUX_PC17A_SDRAMC_A22)
#define PIO_PC17A_SDRAMC_A22                       (1UL << 17) 

#define PIN_PC17A_SDRAMC_NANDCLE                   81L          /**< SDRAMC signal: NANDCLE on PC17 mux A*/
#define MUX_PC17A_SDRAMC_NANDCLE                   0L          
#define PINMUX_PC17A_SDRAMC_NANDCLE                ((PIN_PC17A_SDRAMC_NANDCLE << 16) | MUX_PC17A_SDRAMC_NANDCLE)
#define PIO_PC17A_SDRAMC_NANDCLE                   (1UL << 17) 

#define PIN_PA25C_SDRAMC_A23                       25L          /**< SDRAMC signal: A23 on PA25 mux C*/
#define MUX_PA25C_SDRAMC_A23                       2L          
#define PINMUX_PA25C_SDRAMC_A23                    ((PIN_PA25C_SDRAMC_A23 << 16) | MUX_PA25C_SDRAMC_A23)
#define PIO_PA25C_SDRAMC_A23                       (1UL << 25) 

#define PIN_PD17C_SDRAMC_CAS                       113L         /**< SDRAMC signal: CAS on PD17 mux C*/
#define MUX_PD17C_SDRAMC_CAS                       2L          
#define PINMUX_PD17C_SDRAMC_CAS                    ((PIN_PD17C_SDRAMC_CAS << 16) | MUX_PD17C_SDRAMC_CAS)
#define PIO_PD17C_SDRAMC_CAS                       (1UL << 17) 

#define PIN_PC0A_SDRAMC_D0                         64L          /**< SDRAMC signal: D0 on PC0 mux A*/
#define MUX_PC0A_SDRAMC_D0                         0L          
#define PINMUX_PC0A_SDRAMC_D0                      ((PIN_PC0A_SDRAMC_D0 << 16) | MUX_PC0A_SDRAMC_D0)
#define PIO_PC0A_SDRAMC_D0                         (1UL << 0)  

#define PIN_PC1A_SDRAMC_D1                         65L          /**< SDRAMC signal: D1 on PC1 mux A*/
#define MUX_PC1A_SDRAMC_D1                         0L          
#define PINMUX_PC1A_SDRAMC_D1                      ((PIN_PC1A_SDRAMC_D1 << 16) | MUX_PC1A_SDRAMC_D1)
#define PIO_PC1A_SDRAMC_D1                         (1UL << 1)  

#define PIN_PC2A_SDRAMC_D2                         66L          /**< SDRAMC signal: D2 on PC2 mux A*/
#define MUX_PC2A_SDRAMC_D2                         0L          
#define PINMUX_PC2A_SDRAMC_D2                      ((PIN_PC2A_SDRAMC_D2 << 16) | MUX_PC2A_SDRAMC_D2)
#define PIO_PC2A_SDRAMC_D2                         (1UL << 2)  

#define PIN_PC3A_SDRAMC_D3                         67L          /**< SDRAMC signal: D3 on PC3 mux A*/
#define MUX_PC3A_SDRAMC_D3                         0L          
#define PINMUX_PC3A_SDRAMC_D3                      ((PIN_PC3A_SDRAMC_D3 << 16) | MUX_PC3A_SDRAMC_D3)
#define PIO_PC3A_SDRAMC_D3                         (1UL << 3)  

#define PIN_PC4A_SDRAMC_D4                         68L          /**< SDRAMC signal: D4 on PC4 mux A*/
#define MUX_PC4A_SDRAMC_D4                         0L          
#define PINMUX_PC4A_SDRAMC_D4                      ((PIN_PC4A_SDRAMC_D4 << 16) | MUX_PC4A_SDRAMC_D4)
#define PIO_PC4A_SDRAMC_D4                         (1UL << 4)  

#define PIN_PC5A_SDRAMC_D5                         69L          /**< SDRAMC signal: D5 on PC5 mux A*/
#define MUX_PC5A_SDRAMC_D5                         0L          
#define PINMUX_PC5A_SDRAMC_D5                      ((PIN_PC5A_SDRAMC_D5 << 16) | MUX_PC5A_SDRAMC_D5)
#define PIO_PC5A_SDRAMC_D5                         (1UL << 5)  

#define PIN_PC6A_SDRAMC_D6                         70L          /**< SDRAMC signal: D6 on PC6 mux A*/
#define MUX_PC6A_SDRAMC_D6                         0L          
#define PINMUX_PC6A_SDRAMC_D6                      ((PIN_PC6A_SDRAMC_D6 << 16) | MUX_PC6A_SDRAMC_D6)
#define PIO_PC6A_SDRAMC_D6                         (1UL << 6)  

#define PIN_PC7A_SDRAMC_D7                         71L          /**< SDRAMC signal: D7 on PC7 mux A*/
#define MUX_PC7A_SDRAMC_D7                         0L          
#define PINMUX_PC7A_SDRAMC_D7                      ((PIN_PC7A_SDRAMC_D7 << 16) | MUX_PC7A_SDRAMC_D7)
#define PIO_PC7A_SDRAMC_D7                         (1UL << 7)  

#define PIN_PE0A_SDRAMC_D8                         128L         /**< SDRAMC signal: D8 on PE0 mux A*/
#define MUX_PE0A_SDRAMC_D8                         0L          
#define PINMUX_PE0A_SDRAMC_D8                      ((PIN_PE0A_SDRAMC_D8 << 16) | MUX_PE0A_SDRAMC_D8)
#define PIO_PE0A_SDRAMC_D8                         (1UL << 0)  

#define PIN_PE1A_SDRAMC_D9                         129L         /**< SDRAMC signal: D9 on PE1 mux A*/
#define MUX_PE1A_SDRAMC_D9                         0L          
#define PINMUX_PE1A_SDRAMC_D9                      ((PIN_PE1A_SDRAMC_D9 << 16) | MUX_PE1A_SDRAMC_D9)
#define PIO_PE1A_SDRAMC_D9                         (1UL << 1)  

#define PIN_PE2A_SDRAMC_D10                        130L         /**< SDRAMC signal: D10 on PE2 mux A*/
#define MUX_PE2A_SDRAMC_D10                        0L          
#define PINMUX_PE2A_SDRAMC_D10                     ((PIN_PE2A_SDRAMC_D10 << 16) | MUX_PE2A_SDRAMC_D10)
#define PIO_PE2A_SDRAMC_D10                        (1UL << 2)  

#define PIN_PE3A_SDRAMC_D11                        131L         /**< SDRAMC signal: D11 on PE3 mux A*/
#define MUX_PE3A_SDRAMC_D11                        0L          
#define PINMUX_PE3A_SDRAMC_D11                     ((PIN_PE3A_SDRAMC_D11 << 16) | MUX_PE3A_SDRAMC_D11)
#define PIO_PE3A_SDRAMC_D11                        (1UL << 3)  

#define PIN_PE4A_SDRAMC_D12                        132L         /**< SDRAMC signal: D12 on PE4 mux A*/
#define MUX_PE4A_SDRAMC_D12                        0L          
#define PINMUX_PE4A_SDRAMC_D12                     ((PIN_PE4A_SDRAMC_D12 << 16) | MUX_PE4A_SDRAMC_D12)
#define PIO_PE4A_SDRAMC_D12                        (1UL << 4)  

