zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q21.h
#define PIN_PE5A_SDRAMC_D13                        133L         /**< SDRAMC signal: D13 on PE5 mux A*/
#define MUX_PE5A_SDRAMC_D13                        0L          
#define PINMUX_PE5A_SDRAMC_D13                     ((PIN_PE5A_SDRAMC_D13 << 16) | MUX_PE5A_SDRAMC_D13)
#define PIO_PE5A_SDRAMC_D13                        (1UL << 5)  

#define PIN_PA15A_SDRAMC_D14                       15L          /**< SDRAMC signal: D14 on PA15 mux A*/
#define MUX_PA15A_SDRAMC_D14                       0L          
#define PINMUX_PA15A_SDRAMC_D14                    ((PIN_PA15A_SDRAMC_D14 << 16) | MUX_PA15A_SDRAMC_D14)
#define PIO_PA15A_SDRAMC_D14                       (1UL << 15) 

#define PIN_PA16A_SDRAMC_D15                       16L          /**< SDRAMC signal: D15 on PA16 mux A*/
#define MUX_PA16A_SDRAMC_D15                       0L          
#define PINMUX_PA16A_SDRAMC_D15                    ((PIN_PA16A_SDRAMC_D15 << 16) | MUX_PA16A_SDRAMC_D15)
#define PIO_PA16A_SDRAMC_D15                       (1UL << 16) 

#define PIN_PC9A_SDRAMC_NANDOE                     73L          /**< SDRAMC signal: NANDOE on PC9 mux A*/
#define MUX_PC9A_SDRAMC_NANDOE                     0L          
#define PINMUX_PC9A_SDRAMC_NANDOE                  ((PIN_PC9A_SDRAMC_NANDOE << 16) | MUX_PC9A_SDRAMC_NANDOE)
#define PIO_PC9A_SDRAMC_NANDOE                     (1UL << 9)  

#define PIN_PC10A_SDRAMC_NANDWE                    74L          /**< SDRAMC signal: NANDWE on PC10 mux A*/
#define MUX_PC10A_SDRAMC_NANDWE                    0L          
#define PINMUX_PC10A_SDRAMC_NANDWE                 ((PIN_PC10A_SDRAMC_NANDWE << 16) | MUX_PC10A_SDRAMC_NANDWE)
#define PIO_PC10A_SDRAMC_NANDWE                    (1UL << 10) 

#define PIN_PC14A_SDRAMC_NCS0                      78L          /**< SDRAMC signal: NCS0 on PC14 mux A*/
#define MUX_PC14A_SDRAMC_NCS0                      0L          
#define PINMUX_PC14A_SDRAMC_NCS0                   ((PIN_PC14A_SDRAMC_NCS0 << 16) | MUX_PC14A_SDRAMC_NCS0)
#define PIO_PC14A_SDRAMC_NCS0                      (1UL << 14) 

#define PIN_PC15A_SDRAMC_NCS1                      79L          /**< SDRAMC signal: NCS1 on PC15 mux A*/
#define MUX_PC15A_SDRAMC_NCS1                      0L          
#define PINMUX_PC15A_SDRAMC_NCS1                   ((PIN_PC15A_SDRAMC_NCS1 << 16) | MUX_PC15A_SDRAMC_NCS1)
#define PIO_PC15A_SDRAMC_NCS1                      (1UL << 15) 

#define PIN_PC15A_SDRAMC_SDCS                      79L          /**< SDRAMC signal: SDCS on PC15 mux A*/
#define MUX_PC15A_SDRAMC_SDCS                      0L          
#define PINMUX_PC15A_SDRAMC_SDCS                   ((PIN_PC15A_SDRAMC_SDCS << 16) | MUX_PC15A_SDRAMC_SDCS)
#define PIO_PC15A_SDRAMC_SDCS                      (1UL << 15) 

#define PIN_PD18A_SDRAMC_NCS1                      114L         /**< SDRAMC signal: NCS1 on PD18 mux A*/
#define MUX_PD18A_SDRAMC_NCS1                      0L          
#define PINMUX_PD18A_SDRAMC_NCS1                   ((PIN_PD18A_SDRAMC_NCS1 << 16) | MUX_PD18A_SDRAMC_NCS1)
#define PIO_PD18A_SDRAMC_NCS1                      (1UL << 18) 

#define PIN_PD18A_SDRAMC_SDCS                      114L         /**< SDRAMC signal: SDCS on PD18 mux A*/
#define MUX_PD18A_SDRAMC_SDCS                      0L          
#define PINMUX_PD18A_SDRAMC_SDCS                   ((PIN_PD18A_SDRAMC_SDCS << 16) | MUX_PD18A_SDRAMC_SDCS)
#define PIO_PD18A_SDRAMC_SDCS                      (1UL << 18) 

#define PIN_PA22C_SDRAMC_NCS2                      22L          /**< SDRAMC signal: NCS2 on PA22 mux C*/
#define MUX_PA22C_SDRAMC_NCS2                      2L          
#define PINMUX_PA22C_SDRAMC_NCS2                   ((PIN_PA22C_SDRAMC_NCS2 << 16) | MUX_PA22C_SDRAMC_NCS2)
#define PIO_PA22C_SDRAMC_NCS2                      (1UL << 22) 

#define PIN_PC12A_SDRAMC_NCS3                      76L          /**< SDRAMC signal: NCS3 on PC12 mux A*/
#define MUX_PC12A_SDRAMC_NCS3                      0L          
#define PINMUX_PC12A_SDRAMC_NCS3                   ((PIN_PC12A_SDRAMC_NCS3 << 16) | MUX_PC12A_SDRAMC_NCS3)
#define PIO_PC12A_SDRAMC_NCS3                      (1UL << 12) 

#define PIN_PD19A_SDRAMC_NCS3                      115L         /**< SDRAMC signal: NCS3 on PD19 mux A*/
#define MUX_PD19A_SDRAMC_NCS3                      0L          
#define PINMUX_PD19A_SDRAMC_NCS3                   ((PIN_PD19A_SDRAMC_NCS3 << 16) | MUX_PD19A_SDRAMC_NCS3)
#define PIO_PD19A_SDRAMC_NCS3                      (1UL << 19) 

#define PIN_PC11A_SDRAMC_NRD                       75L          /**< SDRAMC signal: NRD on PC11 mux A*/
#define MUX_PC11A_SDRAMC_NRD                       0L          
#define PINMUX_PC11A_SDRAMC_NRD                    ((PIN_PC11A_SDRAMC_NRD << 16) | MUX_PC11A_SDRAMC_NRD)
#define PIO_PC11A_SDRAMC_NRD                       (1UL << 11) 

#define PIN_PC13A_SDRAMC_NWAIT                     77L          /**< SDRAMC signal: NWAIT on PC13 mux A*/
#define MUX_PC13A_SDRAMC_NWAIT                     0L          
#define PINMUX_PC13A_SDRAMC_NWAIT                  ((PIN_PC13A_SDRAMC_NWAIT << 16) | MUX_PC13A_SDRAMC_NWAIT)
#define PIO_PC13A_SDRAMC_NWAIT                     (1UL << 13) 

#define PIN_PC8A_SDRAMC_NWR0                       72L          /**< SDRAMC signal: NWR0 on PC8 mux A*/
#define MUX_PC8A_SDRAMC_NWR0                       0L          
#define PINMUX_PC8A_SDRAMC_NWR0                    ((PIN_PC8A_SDRAMC_NWR0 << 16) | MUX_PC8A_SDRAMC_NWR0)
#define PIO_PC8A_SDRAMC_NWR0                       (1UL << 8)  

#define PIN_PC8A_SDRAMC_NWE                        72L          /**< SDRAMC signal: NWE on PC8 mux A*/
#define MUX_PC8A_SDRAMC_NWE                        0L          
#define PINMUX_PC8A_SDRAMC_NWE                     ((PIN_PC8A_SDRAMC_NWE << 16) | MUX_PC8A_SDRAMC_NWE)
#define PIO_PC8A_SDRAMC_NWE                        (1UL << 8)  

#define PIN_PD15C_SDRAMC_NWR1                      111L         /**< SDRAMC signal: NWR1 on PD15 mux C*/
#define MUX_PD15C_SDRAMC_NWR1                      2L          
#define PINMUX_PD15C_SDRAMC_NWR1                   ((PIN_PD15C_SDRAMC_NWR1 << 16) | MUX_PD15C_SDRAMC_NWR1)
#define PIO_PD15C_SDRAMC_NWR1                      (1UL << 15) 

#define PIN_PD15C_SDRAMC_NBS1                      111L         /**< SDRAMC signal: NBS1 on PD15 mux C*/
#define MUX_PD15C_SDRAMC_NBS1                      2L          
#define PINMUX_PD15C_SDRAMC_NBS1                   ((PIN_PD15C_SDRAMC_NBS1 << 16) | MUX_PD15C_SDRAMC_NBS1)
#define PIO_PD15C_SDRAMC_NBS1                      (1UL << 15) 

