zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q21.h
#define PIN_PD16C_SDRAMC_RAS                       112L         /**< SDRAMC signal: RAS on PD16 mux C*/
#define MUX_PD16C_SDRAMC_RAS                       2L          
#define PINMUX_PD16C_SDRAMC_RAS                    ((PIN_PD16C_SDRAMC_RAS << 16) | MUX_PD16C_SDRAMC_RAS)
#define PIO_PD16C_SDRAMC_RAS                       (1UL << 16) 

#define PIN_PC13C_SDRAMC_SDA10                     77L          /**< SDRAMC signal: SDA10 on PC13 mux C*/
#define MUX_PC13C_SDRAMC_SDA10                     2L          
#define PINMUX_PC13C_SDRAMC_SDA10                  ((PIN_PC13C_SDRAMC_SDA10 << 16) | MUX_PC13C_SDRAMC_SDA10)
#define PIO_PC13C_SDRAMC_SDA10                     (1UL << 13) 

#define PIN_PD13C_SDRAMC_SDA10                     109L         /**< SDRAMC signal: SDA10 on PD13 mux C*/
#define MUX_PD13C_SDRAMC_SDA10                     2L          
#define PINMUX_PD13C_SDRAMC_SDA10                  ((PIN_PD13C_SDRAMC_SDA10 << 16) | MUX_PD13C_SDRAMC_SDA10)
#define PIO_PD13C_SDRAMC_SDA10                     (1UL << 13) 

#define PIN_PD23C_SDRAMC_SDCK                      119L         /**< SDRAMC signal: SDCK on PD23 mux C*/
#define MUX_PD23C_SDRAMC_SDCK                      2L          
#define PINMUX_PD23C_SDRAMC_SDCK                   ((PIN_PD23C_SDRAMC_SDCK << 16) | MUX_PD23C_SDRAMC_SDCK)
#define PIO_PD23C_SDRAMC_SDCK                      (1UL << 23) 

#define PIN_PD14C_SDRAMC_SDCKE                     110L         /**< SDRAMC signal: SDCKE on PD14 mux C*/
#define MUX_PD14C_SDRAMC_SDCKE                     2L          
#define PINMUX_PD14C_SDRAMC_SDCKE                  ((PIN_PD14C_SDRAMC_SDCKE << 16) | MUX_PD14C_SDRAMC_SDCKE)
#define PIO_PD14C_SDRAMC_SDCKE                     (1UL << 14) 

#define PIN_PD29C_SDRAMC_SDWE                      125L         /**< SDRAMC signal: SDWE on PD29 mux C*/
#define MUX_PD29C_SDRAMC_SDWE                      2L          
#define PINMUX_PD29C_SDRAMC_SDWE                   ((PIN_PD29C_SDRAMC_SDWE << 16) | MUX_PD29C_SDRAMC_SDWE)
#define PIO_PD29C_SDRAMC_SDWE                      (1UL << 29) 

/* ========== PIO definition for SMC peripheral ========== */
#define PIN_PC18A_SMC_A0                           82L          /**< SMC signal: A0 on PC18 mux A*/
#define MUX_PC18A_SMC_A0                           0L          
#define PINMUX_PC18A_SMC_A0                        ((PIN_PC18A_SMC_A0 << 16) | MUX_PC18A_SMC_A0)
#define PIO_PC18A_SMC_A0                           (1UL << 18) 

#define PIN_PC18A_SMC_NBS0                         82L          /**< SMC signal: NBS0 on PC18 mux A*/
#define MUX_PC18A_SMC_NBS0                         0L          
#define PINMUX_PC18A_SMC_NBS0                      ((PIN_PC18A_SMC_NBS0 << 16) | MUX_PC18A_SMC_NBS0)
#define PIO_PC18A_SMC_NBS0                         (1UL << 18) 

#define PIN_PC19A_SMC_A1                           83L          /**< SMC signal: A1 on PC19 mux A*/
#define MUX_PC19A_SMC_A1                           0L          
#define PINMUX_PC19A_SMC_A1                        ((PIN_PC19A_SMC_A1 << 16) | MUX_PC19A_SMC_A1)
#define PIO_PC19A_SMC_A1                           (1UL << 19) 

#define PIN_PC20A_SMC_A2                           84L          /**< SMC signal: A2 on PC20 mux A*/
#define MUX_PC20A_SMC_A2                           0L          
#define PINMUX_PC20A_SMC_A2                        ((PIN_PC20A_SMC_A2 << 16) | MUX_PC20A_SMC_A2)
#define PIO_PC20A_SMC_A2                           (1UL << 20) 

#define PIN_PC21A_SMC_A3                           85L          /**< SMC signal: A3 on PC21 mux A*/
#define MUX_PC21A_SMC_A3                           0L          
#define PINMUX_PC21A_SMC_A3                        ((PIN_PC21A_SMC_A3 << 16) | MUX_PC21A_SMC_A3)
#define PIO_PC21A_SMC_A3                           (1UL << 21) 

#define PIN_PC22A_SMC_A4                           86L          /**< SMC signal: A4 on PC22 mux A*/
#define MUX_PC22A_SMC_A4                           0L          
#define PINMUX_PC22A_SMC_A4                        ((PIN_PC22A_SMC_A4 << 16) | MUX_PC22A_SMC_A4)
#define PIO_PC22A_SMC_A4                           (1UL << 22) 

#define PIN_PC23A_SMC_A5                           87L          /**< SMC signal: A5 on PC23 mux A*/
#define MUX_PC23A_SMC_A5                           0L          
#define PINMUX_PC23A_SMC_A5                        ((PIN_PC23A_SMC_A5 << 16) | MUX_PC23A_SMC_A5)
#define PIO_PC23A_SMC_A5                           (1UL << 23) 

#define PIN_PC24A_SMC_A6                           88L          /**< SMC signal: A6 on PC24 mux A*/
#define MUX_PC24A_SMC_A6                           0L          
#define PINMUX_PC24A_SMC_A6                        ((PIN_PC24A_SMC_A6 << 16) | MUX_PC24A_SMC_A6)
#define PIO_PC24A_SMC_A6                           (1UL << 24) 

#define PIN_PC25A_SMC_A7                           89L          /**< SMC signal: A7 on PC25 mux A*/
#define MUX_PC25A_SMC_A7                           0L          
#define PINMUX_PC25A_SMC_A7                        ((PIN_PC25A_SMC_A7 << 16) | MUX_PC25A_SMC_A7)
#define PIO_PC25A_SMC_A7                           (1UL << 25) 

#define PIN_PC26A_SMC_A8                           90L          /**< SMC signal: A8 on PC26 mux A*/
#define MUX_PC26A_SMC_A8                           0L          
#define PINMUX_PC26A_SMC_A8                        ((PIN_PC26A_SMC_A8 << 16) | MUX_PC26A_SMC_A8)
#define PIO_PC26A_SMC_A8                           (1UL << 26) 

#define PIN_PC27A_SMC_A9                           91L          /**< SMC signal: A9 on PC27 mux A*/
#define MUX_PC27A_SMC_A9                           0L          
#define PINMUX_PC27A_SMC_A9                        ((PIN_PC27A_SMC_A9 << 16) | MUX_PC27A_SMC_A9)
#define PIO_PC27A_SMC_A9                           (1UL << 27) 

#define PIN_PC28A_SMC_A10                          92L          /**< SMC signal: A10 on PC28 mux A*/
#define MUX_PC28A_SMC_A10                          0L          
#define PINMUX_PC28A_SMC_A10                       ((PIN_PC28A_SMC_A10 << 16) | MUX_PC28A_SMC_A10)
#define PIO_PC28A_SMC_A10                          (1UL << 28) 

#define PIN_PC29A_SMC_A11                          93L          /**< SMC signal: A11 on PC29 mux A*/
#define MUX_PC29A_SMC_A11                          0L          
#define PINMUX_PC29A_SMC_A11                       ((PIN_PC29A_SMC_A11 << 16) | MUX_PC29A_SMC_A11)
#define PIO_PC29A_SMC_A11                          (1UL << 29) 

#define PIN_PC30A_SMC_A12                          94L          /**< SMC signal: A12 on PC30 mux A*/
#define MUX_PC30A_SMC_A12                          0L          
#define PINMUX_PC30A_SMC_A12                       ((PIN_PC30A_SMC_A12 << 16) | MUX_PC30A_SMC_A12)
#define PIO_PC30A_SMC_A12                          (1UL << 30) 

#define PIN_PC31A_SMC_A13                          95L          /**< SMC signal: A13 on PC31 mux A*/
#define MUX_PC31A_SMC_A13                          0L          
#define PINMUX_PC31A_SMC_A13                       ((PIN_PC31A_SMC_A13 << 16) | MUX_PC31A_SMC_A13)
#define PIO_PC31A_SMC_A13                          (1UL << 31) 

#define PIN_PA18C_SMC_A14                          18L          /**< SMC signal: A14 on PA18 mux C*/
#define MUX_PA18C_SMC_A14                          2L          
#define PINMUX_PA18C_SMC_A14                       ((PIN_PA18C_SMC_A14 << 16) | MUX_PA18C_SMC_A14)
#define PIO_PA18C_SMC_A14                          (1UL << 18) 

