zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q21.h
#define PIN_PA19C_SMC_A15                          19L          /**< SMC signal: A15 on PA19 mux C*/
#define MUX_PA19C_SMC_A15                          2L          
#define PINMUX_PA19C_SMC_A15                       ((PIN_PA19C_SMC_A15 << 16) | MUX_PA19C_SMC_A15)
#define PIO_PA19C_SMC_A15                          (1UL << 19) 

#define PIN_PA20C_SMC_A16                          20L          /**< SMC signal: A16 on PA20 mux C*/
#define MUX_PA20C_SMC_A16                          2L          
#define PINMUX_PA20C_SMC_A16                       ((PIN_PA20C_SMC_A16 << 16) | MUX_PA20C_SMC_A16)
#define PIO_PA20C_SMC_A16                          (1UL << 20) 

#define PIN_PA20C_SMC_BA0                          20L          /**< SMC signal: BA0 on PA20 mux C*/
#define MUX_PA20C_SMC_BA0                          2L          
#define PINMUX_PA20C_SMC_BA0                       ((PIN_PA20C_SMC_BA0 << 16) | MUX_PA20C_SMC_BA0)
#define PIO_PA20C_SMC_BA0                          (1UL << 20) 

#define PIN_PA0C_SMC_A17                           0L           /**< SMC signal: A17 on PA0 mux C*/
#define MUX_PA0C_SMC_A17                           2L          
#define PINMUX_PA0C_SMC_A17                        ((PIN_PA0C_SMC_A17 << 16) | MUX_PA0C_SMC_A17)
#define PIO_PA0C_SMC_A17                           (1UL << 0)  

#define PIN_PA0C_SMC_BA1                           0L           /**< SMC signal: BA1 on PA0 mux C*/
#define MUX_PA0C_SMC_BA1                           2L          
#define PINMUX_PA0C_SMC_BA1                        ((PIN_PA0C_SMC_BA1 << 16) | MUX_PA0C_SMC_BA1)
#define PIO_PA0C_SMC_BA1                           (1UL << 0)  

#define PIN_PA1C_SMC_A18                           1L           /**< SMC signal: A18 on PA1 mux C*/
#define MUX_PA1C_SMC_A18                           2L          
#define PINMUX_PA1C_SMC_A18                        ((PIN_PA1C_SMC_A18 << 16) | MUX_PA1C_SMC_A18)
#define PIO_PA1C_SMC_A18                           (1UL << 1)  

#define PIN_PA23C_SMC_A19                          23L          /**< SMC signal: A19 on PA23 mux C*/
#define MUX_PA23C_SMC_A19                          2L          
#define PINMUX_PA23C_SMC_A19                       ((PIN_PA23C_SMC_A19 << 16) | MUX_PA23C_SMC_A19)
#define PIO_PA23C_SMC_A19                          (1UL << 23) 

#define PIN_PA24C_SMC_A20                          24L          /**< SMC signal: A20 on PA24 mux C*/
#define MUX_PA24C_SMC_A20                          2L          
#define PINMUX_PA24C_SMC_A20                       ((PIN_PA24C_SMC_A20 << 16) | MUX_PA24C_SMC_A20)
#define PIO_PA24C_SMC_A20                          (1UL << 24) 

#define PIN_PC16A_SMC_A21                          80L          /**< SMC signal: A21 on PC16 mux A*/
#define MUX_PC16A_SMC_A21                          0L          
#define PINMUX_PC16A_SMC_A21                       ((PIN_PC16A_SMC_A21 << 16) | MUX_PC16A_SMC_A21)
#define PIO_PC16A_SMC_A21                          (1UL << 16) 

#define PIN_PC16A_SMC_NANDALE                      80L          /**< SMC signal: NANDALE on PC16 mux A*/
#define MUX_PC16A_SMC_NANDALE                      0L          
#define PINMUX_PC16A_SMC_NANDALE                   ((PIN_PC16A_SMC_NANDALE << 16) | MUX_PC16A_SMC_NANDALE)
#define PIO_PC16A_SMC_NANDALE                      (1UL << 16) 

#define PIN_PC17A_SMC_A22                          81L          /**< SMC signal: A22 on PC17 mux A*/
#define MUX_PC17A_SMC_A22                          0L          
#define PINMUX_PC17A_SMC_A22                       ((PIN_PC17A_SMC_A22 << 16) | MUX_PC17A_SMC_A22)
#define PIO_PC17A_SMC_A22                          (1UL << 17) 

#define PIN_PC17A_SMC_NANDCLE                      81L          /**< SMC signal: NANDCLE on PC17 mux A*/
#define MUX_PC17A_SMC_NANDCLE                      0L          
#define PINMUX_PC17A_SMC_NANDCLE                   ((PIN_PC17A_SMC_NANDCLE << 16) | MUX_PC17A_SMC_NANDCLE)
#define PIO_PC17A_SMC_NANDCLE                      (1UL << 17) 

#define PIN_PA25C_SMC_A23                          25L          /**< SMC signal: A23 on PA25 mux C*/
#define MUX_PA25C_SMC_A23                          2L          
#define PINMUX_PA25C_SMC_A23                       ((PIN_PA25C_SMC_A23 << 16) | MUX_PA25C_SMC_A23)
#define PIO_PA25C_SMC_A23                          (1UL << 25) 

#define PIN_PD17C_SMC_CAS                          113L         /**< SMC signal: CAS on PD17 mux C*/
#define MUX_PD17C_SMC_CAS                          2L          
#define PINMUX_PD17C_SMC_CAS                       ((PIN_PD17C_SMC_CAS << 16) | MUX_PD17C_SMC_CAS)
#define PIO_PD17C_SMC_CAS                          (1UL << 17) 

#define PIN_PC0A_SMC_D0                            64L          /**< SMC signal: D0 on PC0 mux A*/
#define MUX_PC0A_SMC_D0                            0L          
#define PINMUX_PC0A_SMC_D0                         ((PIN_PC0A_SMC_D0 << 16) | MUX_PC0A_SMC_D0)
#define PIO_PC0A_SMC_D0                            (1UL << 0)  

#define PIN_PC1A_SMC_D1                            65L          /**< SMC signal: D1 on PC1 mux A*/
#define MUX_PC1A_SMC_D1                            0L          
#define PINMUX_PC1A_SMC_D1                         ((PIN_PC1A_SMC_D1 << 16) | MUX_PC1A_SMC_D1)
#define PIO_PC1A_SMC_D1                            (1UL << 1)  

#define PIN_PC2A_SMC_D2                            66L          /**< SMC signal: D2 on PC2 mux A*/
#define MUX_PC2A_SMC_D2                            0L          
#define PINMUX_PC2A_SMC_D2                         ((PIN_PC2A_SMC_D2 << 16) | MUX_PC2A_SMC_D2)
#define PIO_PC2A_SMC_D2                            (1UL << 2)  

#define PIN_PC3A_SMC_D3                            67L          /**< SMC signal: D3 on PC3 mux A*/
#define MUX_PC3A_SMC_D3                            0L          
#define PINMUX_PC3A_SMC_D3                         ((PIN_PC3A_SMC_D3 << 16) | MUX_PC3A_SMC_D3)
#define PIO_PC3A_SMC_D3                            (1UL << 3)  

#define PIN_PC4A_SMC_D4                            68L          /**< SMC signal: D4 on PC4 mux A*/
#define MUX_PC4A_SMC_D4                            0L          
#define PINMUX_PC4A_SMC_D4                         ((PIN_PC4A_SMC_D4 << 16) | MUX_PC4A_SMC_D4)
#define PIO_PC4A_SMC_D4                            (1UL << 4)  

#define PIN_PC5A_SMC_D5                            69L          /**< SMC signal: D5 on PC5 mux A*/
#define MUX_PC5A_SMC_D5                            0L          
#define PINMUX_PC5A_SMC_D5                         ((PIN_PC5A_SMC_D5 << 16) | MUX_PC5A_SMC_D5)
#define PIO_PC5A_SMC_D5                            (1UL << 5)  

#define PIN_PC6A_SMC_D6                            70L          /**< SMC signal: D6 on PC6 mux A*/
#define MUX_PC6A_SMC_D6                            0L          
#define PINMUX_PC6A_SMC_D6                         ((PIN_PC6A_SMC_D6 << 16) | MUX_PC6A_SMC_D6)
#define PIO_PC6A_SMC_D6                            (1UL << 6)  

#define PIN_PC7A_SMC_D7                            71L          /**< SMC signal: D7 on PC7 mux A*/
#define MUX_PC7A_SMC_D7                            0L          
#define PINMUX_PC7A_SMC_D7                         ((PIN_PC7A_SMC_D7 << 16) | MUX_PC7A_SMC_D7)
#define PIO_PC7A_SMC_D7                            (1UL << 7)  

