zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q21.h
#define PIN_PE0A_SMC_D8                            128L         /**< SMC signal: D8 on PE0 mux A*/
#define MUX_PE0A_SMC_D8                            0L          
#define PINMUX_PE0A_SMC_D8                         ((PIN_PE0A_SMC_D8 << 16) | MUX_PE0A_SMC_D8)
#define PIO_PE0A_SMC_D8                            (1UL << 0)  

#define PIN_PE1A_SMC_D9                            129L         /**< SMC signal: D9 on PE1 mux A*/
#define MUX_PE1A_SMC_D9                            0L          
#define PINMUX_PE1A_SMC_D9                         ((PIN_PE1A_SMC_D9 << 16) | MUX_PE1A_SMC_D9)
#define PIO_PE1A_SMC_D9                            (1UL << 1)  

#define PIN_PE2A_SMC_D10                           130L         /**< SMC signal: D10 on PE2 mux A*/
#define MUX_PE2A_SMC_D10                           0L          
#define PINMUX_PE2A_SMC_D10                        ((PIN_PE2A_SMC_D10 << 16) | MUX_PE2A_SMC_D10)
#define PIO_PE2A_SMC_D10                           (1UL << 2)  

#define PIN_PE3A_SMC_D11                           131L         /**< SMC signal: D11 on PE3 mux A*/
#define MUX_PE3A_SMC_D11                           0L          
#define PINMUX_PE3A_SMC_D11                        ((PIN_PE3A_SMC_D11 << 16) | MUX_PE3A_SMC_D11)
#define PIO_PE3A_SMC_D11                           (1UL << 3)  

#define PIN_PE4A_SMC_D12                           132L         /**< SMC signal: D12 on PE4 mux A*/
#define MUX_PE4A_SMC_D12                           0L          
#define PINMUX_PE4A_SMC_D12                        ((PIN_PE4A_SMC_D12 << 16) | MUX_PE4A_SMC_D12)
#define PIO_PE4A_SMC_D12                           (1UL << 4)  

#define PIN_PE5A_SMC_D13                           133L         /**< SMC signal: D13 on PE5 mux A*/
#define MUX_PE5A_SMC_D13                           0L          
#define PINMUX_PE5A_SMC_D13                        ((PIN_PE5A_SMC_D13 << 16) | MUX_PE5A_SMC_D13)
#define PIO_PE5A_SMC_D13                           (1UL << 5)  

#define PIN_PA15A_SMC_D14                          15L          /**< SMC signal: D14 on PA15 mux A*/
#define MUX_PA15A_SMC_D14                          0L          
#define PINMUX_PA15A_SMC_D14                       ((PIN_PA15A_SMC_D14 << 16) | MUX_PA15A_SMC_D14)
#define PIO_PA15A_SMC_D14                          (1UL << 15) 

#define PIN_PA16A_SMC_D15                          16L          /**< SMC signal: D15 on PA16 mux A*/
#define MUX_PA16A_SMC_D15                          0L          
#define PINMUX_PA16A_SMC_D15                       ((PIN_PA16A_SMC_D15 << 16) | MUX_PA16A_SMC_D15)
#define PIO_PA16A_SMC_D15                          (1UL << 16) 

#define PIN_PC9A_SMC_NANDOE                        73L          /**< SMC signal: NANDOE on PC9 mux A*/
#define MUX_PC9A_SMC_NANDOE                        0L          
#define PINMUX_PC9A_SMC_NANDOE                     ((PIN_PC9A_SMC_NANDOE << 16) | MUX_PC9A_SMC_NANDOE)
#define PIO_PC9A_SMC_NANDOE                        (1UL << 9)  

#define PIN_PC10A_SMC_NANDWE                       74L          /**< SMC signal: NANDWE on PC10 mux A*/
#define MUX_PC10A_SMC_NANDWE                       0L          
#define PINMUX_PC10A_SMC_NANDWE                    ((PIN_PC10A_SMC_NANDWE << 16) | MUX_PC10A_SMC_NANDWE)
#define PIO_PC10A_SMC_NANDWE                       (1UL << 10) 

#define PIN_PC14A_SMC_NCS0                         78L          /**< SMC signal: NCS0 on PC14 mux A*/
#define MUX_PC14A_SMC_NCS0                         0L          
#define PINMUX_PC14A_SMC_NCS0                      ((PIN_PC14A_SMC_NCS0 << 16) | MUX_PC14A_SMC_NCS0)
#define PIO_PC14A_SMC_NCS0                         (1UL << 14) 

#define PIN_PC15A_SMC_NCS1                         79L          /**< SMC signal: NCS1 on PC15 mux A*/
#define MUX_PC15A_SMC_NCS1                         0L          
#define PINMUX_PC15A_SMC_NCS1                      ((PIN_PC15A_SMC_NCS1 << 16) | MUX_PC15A_SMC_NCS1)
#define PIO_PC15A_SMC_NCS1                         (1UL << 15) 

#define PIN_PC15A_SMC_SDCS                         79L          /**< SMC signal: SDCS on PC15 mux A*/
#define MUX_PC15A_SMC_SDCS                         0L          
#define PINMUX_PC15A_SMC_SDCS                      ((PIN_PC15A_SMC_SDCS << 16) | MUX_PC15A_SMC_SDCS)
#define PIO_PC15A_SMC_SDCS                         (1UL << 15) 

#define PIN_PD18A_SMC_NCS1                         114L         /**< SMC signal: NCS1 on PD18 mux A*/
#define MUX_PD18A_SMC_NCS1                         0L          
#define PINMUX_PD18A_SMC_NCS1                      ((PIN_PD18A_SMC_NCS1 << 16) | MUX_PD18A_SMC_NCS1)
#define PIO_PD18A_SMC_NCS1                         (1UL << 18) 

#define PIN_PD18A_SMC_SDCS                         114L         /**< SMC signal: SDCS on PD18 mux A*/
#define MUX_PD18A_SMC_SDCS                         0L          
#define PINMUX_PD18A_SMC_SDCS                      ((PIN_PD18A_SMC_SDCS << 16) | MUX_PD18A_SMC_SDCS)
#define PIO_PD18A_SMC_SDCS                         (1UL << 18) 

#define PIN_PA22C_SMC_NCS2                         22L          /**< SMC signal: NCS2 on PA22 mux C*/
#define MUX_PA22C_SMC_NCS2                         2L          
#define PINMUX_PA22C_SMC_NCS2                      ((PIN_PA22C_SMC_NCS2 << 16) | MUX_PA22C_SMC_NCS2)
#define PIO_PA22C_SMC_NCS2                         (1UL << 22) 

#define PIN_PC12A_SMC_NCS3                         76L          /**< SMC signal: NCS3 on PC12 mux A*/
#define MUX_PC12A_SMC_NCS3                         0L          
#define PINMUX_PC12A_SMC_NCS3                      ((PIN_PC12A_SMC_NCS3 << 16) | MUX_PC12A_SMC_NCS3)
#define PIO_PC12A_SMC_NCS3                         (1UL << 12) 

#define PIN_PD19A_SMC_NCS3                         115L         /**< SMC signal: NCS3 on PD19 mux A*/
#define MUX_PD19A_SMC_NCS3                         0L          
#define PINMUX_PD19A_SMC_NCS3                      ((PIN_PD19A_SMC_NCS3 << 16) | MUX_PD19A_SMC_NCS3)
#define PIO_PD19A_SMC_NCS3                         (1UL << 19) 

#define PIN_PC11A_SMC_NRD                          75L          /**< SMC signal: NRD on PC11 mux A*/
#define MUX_PC11A_SMC_NRD                          0L          
#define PINMUX_PC11A_SMC_NRD                       ((PIN_PC11A_SMC_NRD << 16) | MUX_PC11A_SMC_NRD)
#define PIO_PC11A_SMC_NRD                          (1UL << 11) 

#define PIN_PC13A_SMC_NWAIT                        77L          /**< SMC signal: NWAIT on PC13 mux A*/
#define MUX_PC13A_SMC_NWAIT                        0L          
#define PINMUX_PC13A_SMC_NWAIT                     ((PIN_PC13A_SMC_NWAIT << 16) | MUX_PC13A_SMC_NWAIT)
#define PIO_PC13A_SMC_NWAIT                        (1UL << 13) 

#define PIN_PC8A_SMC_NWR0                          72L          /**< SMC signal: NWR0 on PC8 mux A*/
#define MUX_PC8A_SMC_NWR0                          0L          
#define PINMUX_PC8A_SMC_NWR0                       ((PIN_PC8A_SMC_NWR0 << 16) | MUX_PC8A_SMC_NWR0)
#define PIO_PC8A_SMC_NWR0                          (1UL << 8)  

#define PIN_PC8A_SMC_NWE                           72L          /**< SMC signal: NWE on PC8 mux A*/
#define MUX_PC8A_SMC_NWE                           0L          
#define PINMUX_PC8A_SMC_NWE                        ((PIN_PC8A_SMC_NWE << 16) | MUX_PC8A_SMC_NWE)
#define PIO_PC8A_SMC_NWE                           (1UL << 8)  

