zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q21.h
#define PIN_PD15C_SMC_NWR1                         111L         /**< SMC signal: NWR1 on PD15 mux C*/
#define MUX_PD15C_SMC_NWR1                         2L          
#define PINMUX_PD15C_SMC_NWR1                      ((PIN_PD15C_SMC_NWR1 << 16) | MUX_PD15C_SMC_NWR1)
#define PIO_PD15C_SMC_NWR1                         (1UL << 15) 

#define PIN_PD15C_SMC_NBS1                         111L         /**< SMC signal: NBS1 on PD15 mux C*/
#define MUX_PD15C_SMC_NBS1                         2L          
#define PINMUX_PD15C_SMC_NBS1                      ((PIN_PD15C_SMC_NBS1 << 16) | MUX_PD15C_SMC_NBS1)
#define PIO_PD15C_SMC_NBS1                         (1UL << 15) 

#define PIN_PD16C_SMC_RAS                          112L         /**< SMC signal: RAS on PD16 mux C*/
#define MUX_PD16C_SMC_RAS                          2L          
#define PINMUX_PD16C_SMC_RAS                       ((PIN_PD16C_SMC_RAS << 16) | MUX_PD16C_SMC_RAS)
#define PIO_PD16C_SMC_RAS                          (1UL << 16) 

#define PIN_PC13C_SMC_SDA10                        77L          /**< SMC signal: SDA10 on PC13 mux C*/
#define MUX_PC13C_SMC_SDA10                        2L          
#define PINMUX_PC13C_SMC_SDA10                     ((PIN_PC13C_SMC_SDA10 << 16) | MUX_PC13C_SMC_SDA10)
#define PIO_PC13C_SMC_SDA10                        (1UL << 13) 

#define PIN_PD13C_SMC_SDA10                        109L         /**< SMC signal: SDA10 on PD13 mux C*/
#define MUX_PD13C_SMC_SDA10                        2L          
#define PINMUX_PD13C_SMC_SDA10                     ((PIN_PD13C_SMC_SDA10 << 16) | MUX_PD13C_SMC_SDA10)
#define PIO_PD13C_SMC_SDA10                        (1UL << 13) 

#define PIN_PD23C_SMC_SDCK                         119L         /**< SMC signal: SDCK on PD23 mux C*/
#define MUX_PD23C_SMC_SDCK                         2L          
#define PINMUX_PD23C_SMC_SDCK                      ((PIN_PD23C_SMC_SDCK << 16) | MUX_PD23C_SMC_SDCK)
#define PIO_PD23C_SMC_SDCK                         (1UL << 23) 

#define PIN_PD14C_SMC_SDCKE                        110L         /**< SMC signal: SDCKE on PD14 mux C*/
#define MUX_PD14C_SMC_SDCKE                        2L          
#define PINMUX_PD14C_SMC_SDCKE                     ((PIN_PD14C_SMC_SDCKE << 16) | MUX_PD14C_SMC_SDCKE)
#define PIO_PD14C_SMC_SDCKE                        (1UL << 14) 

#define PIN_PD29C_SMC_SDWE                         125L         /**< SMC signal: SDWE on PD29 mux C*/
#define MUX_PD29C_SMC_SDWE                         2L          
#define PINMUX_PD29C_SMC_SDWE                      ((PIN_PD29C_SMC_SDWE << 16) | MUX_PD29C_SMC_SDWE)
#define PIO_PD29C_SMC_SDWE                         (1UL << 29) 

/* ========== PIO definition for SPI0 peripheral ========== */
#define PIN_PD20B_SPI0_MISO                        116L         /**< SPI0 signal: MISO on PD20 mux B*/
#define MUX_PD20B_SPI0_MISO                        1L          
#define PINMUX_PD20B_SPI0_MISO                     ((PIN_PD20B_SPI0_MISO << 16) | MUX_PD20B_SPI0_MISO)
#define PIO_PD20B_SPI0_MISO                        (1UL << 20) 

#define PIN_PD21B_SPI0_MOSI                        117L         /**< SPI0 signal: MOSI on PD21 mux B*/
#define MUX_PD21B_SPI0_MOSI                        1L          
#define PINMUX_PD21B_SPI0_MOSI                     ((PIN_PD21B_SPI0_MOSI << 16) | MUX_PD21B_SPI0_MOSI)
#define PIO_PD21B_SPI0_MOSI                        (1UL << 21) 

#define PIN_PB2D_SPI0_NPCS0                        34L          /**< SPI0 signal: NPCS0 on PB2 mux D*/
#define MUX_PB2D_SPI0_NPCS0                        3L          
#define PINMUX_PB2D_SPI0_NPCS0                     ((PIN_PB2D_SPI0_NPCS0 << 16) | MUX_PB2D_SPI0_NPCS0)
#define PIO_PB2D_SPI0_NPCS0                        (1UL << 2)  

#define PIN_PA31A_SPI0_NPCS1                       31L          /**< SPI0 signal: NPCS1 on PA31 mux A*/
#define MUX_PA31A_SPI0_NPCS1                       0L          
#define PINMUX_PA31A_SPI0_NPCS1                    ((PIN_PA31A_SPI0_NPCS1 << 16) | MUX_PA31A_SPI0_NPCS1)
#define PIO_PA31A_SPI0_NPCS1                       (1UL << 31) 

#define PIN_PD25B_SPI0_NPCS1                       121L         /**< SPI0 signal: NPCS1 on PD25 mux B*/
#define MUX_PD25B_SPI0_NPCS1                       1L          
#define PINMUX_PD25B_SPI0_NPCS1                    ((PIN_PD25B_SPI0_NPCS1 << 16) | MUX_PD25B_SPI0_NPCS1)
#define PIO_PD25B_SPI0_NPCS1                       (1UL << 25) 

#define PIN_PD12C_SPI0_NPCS2                       108L         /**< SPI0 signal: NPCS2 on PD12 mux C*/
#define MUX_PD12C_SPI0_NPCS2                       2L          
#define PINMUX_PD12C_SPI0_NPCS2                    ((PIN_PD12C_SPI0_NPCS2 << 16) | MUX_PD12C_SPI0_NPCS2)
#define PIO_PD12C_SPI0_NPCS2                       (1UL << 12) 

#define PIN_PD27B_SPI0_NPCS3                       123L         /**< SPI0 signal: NPCS3 on PD27 mux B*/
#define MUX_PD27B_SPI0_NPCS3                       1L          
#define PINMUX_PD27B_SPI0_NPCS3                    ((PIN_PD27B_SPI0_NPCS3 << 16) | MUX_PD27B_SPI0_NPCS3)
#define PIO_PD27B_SPI0_NPCS3                       (1UL << 27) 

#define PIN_PD22B_SPI0_SPCK                        118L         /**< SPI0 signal: SPCK on PD22 mux B*/
#define MUX_PD22B_SPI0_SPCK                        1L          
#define PINMUX_PD22B_SPI0_SPCK                     ((PIN_PD22B_SPI0_SPCK << 16) | MUX_PD22B_SPI0_SPCK)
#define PIO_PD22B_SPI0_SPCK                        (1UL << 22) 

/* ========== PIO definition for SPI1 peripheral ========== */
#define PIN_PC26C_SPI1_MISO                        90L          /**< SPI1 signal: MISO on PC26 mux C*/
#define MUX_PC26C_SPI1_MISO                        2L          
#define PINMUX_PC26C_SPI1_MISO                     ((PIN_PC26C_SPI1_MISO << 16) | MUX_PC26C_SPI1_MISO)
#define PIO_PC26C_SPI1_MISO                        (1UL << 26) 

#define PIN_PC27C_SPI1_MOSI                        91L          /**< SPI1 signal: MOSI on PC27 mux C*/
#define MUX_PC27C_SPI1_MOSI                        2L          
#define PINMUX_PC27C_SPI1_MOSI                     ((PIN_PC27C_SPI1_MOSI << 16) | MUX_PC27C_SPI1_MOSI)
#define PIO_PC27C_SPI1_MOSI                        (1UL << 27) 

#define PIN_PC25C_SPI1_NPCS0                       89L          /**< SPI1 signal: NPCS0 on PC25 mux C*/
#define MUX_PC25C_SPI1_NPCS0                       2L          
#define PINMUX_PC25C_SPI1_NPCS0                    ((PIN_PC25C_SPI1_NPCS0 << 16) | MUX_PC25C_SPI1_NPCS0)
#define PIO_PC25C_SPI1_NPCS0                       (1UL << 25) 

#define PIN_PC28C_SPI1_NPCS1                       92L          /**< SPI1 signal: NPCS1 on PC28 mux C*/
#define MUX_PC28C_SPI1_NPCS1                       2L          
#define PINMUX_PC28C_SPI1_NPCS1                    ((PIN_PC28C_SPI1_NPCS1 << 16) | MUX_PC28C_SPI1_NPCS1)
#define PIO_PC28C_SPI1_NPCS1                       (1UL << 28) 

#define PIN_PD0C_SPI1_NPCS1                        96L          /**< SPI1 signal: NPCS1 on PD0 mux C*/
#define MUX_PD0C_SPI1_NPCS1                        2L          
#define PINMUX_PD0C_SPI1_NPCS1                     ((PIN_PD0C_SPI1_NPCS1 << 16) | MUX_PD0C_SPI1_NPCS1)
#define PIO_PD0C_SPI1_NPCS1                        (1UL << 0)  

