zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q21.h
#define PIN_PA1B_TC0_TIOB0                         1L           /**< TC0 signal: TIOB0 on PA1 mux B*/
#define MUX_PA1B_TC0_TIOB0                         1L          
#define PINMUX_PA1B_TC0_TIOB0                      ((PIN_PA1B_TC0_TIOB0 << 16) | MUX_PA1B_TC0_TIOB0)
#define PIO_PA1B_TC0_TIOB0                         (1UL << 1)  

#define PIN_PA16B_TC0_TIOB1                        16L          /**< TC0 signal: TIOB1 on PA16 mux B*/
#define MUX_PA16B_TC0_TIOB1                        1L          
#define PINMUX_PA16B_TC0_TIOB1                     ((PIN_PA16B_TC0_TIOB1 << 16) | MUX_PA16B_TC0_TIOB1)
#define PIO_PA16B_TC0_TIOB1                        (1UL << 16) 

#define PIN_PA27B_TC0_TIOB2                        27L          /**< TC0 signal: TIOB2 on PA27 mux B*/
#define MUX_PA27B_TC0_TIOB2                        1L          
#define PINMUX_PA27B_TC0_TIOB2                     ((PIN_PA27B_TC0_TIOB2 << 16) | MUX_PA27B_TC0_TIOB2)
#define PIO_PA27B_TC0_TIOB2                        (1UL << 27) 

/* ========== PIO definition for TC1 peripheral ========== */
#define PIN_PC25B_TC1_TCLK3                        89L          /**< TC1 signal: TCLK3 on PC25 mux B*/
#define MUX_PC25B_TC1_TCLK3                        1L          
#define PINMUX_PC25B_TC1_TCLK3                     ((PIN_PC25B_TC1_TCLK3 << 16) | MUX_PC25B_TC1_TCLK3)
#define PIO_PC25B_TC1_TCLK3                        (1UL << 25) 

#define PIN_PC28B_TC1_TCLK4                        92L          /**< TC1 signal: TCLK4 on PC28 mux B*/
#define MUX_PC28B_TC1_TCLK4                        1L          
#define PINMUX_PC28B_TC1_TCLK4                     ((PIN_PC28B_TC1_TCLK4 << 16) | MUX_PC28B_TC1_TCLK4)
#define PIO_PC28B_TC1_TCLK4                        (1UL << 28) 

#define PIN_PC31B_TC1_TCLK5                        95L          /**< TC1 signal: TCLK5 on PC31 mux B*/
#define MUX_PC31B_TC1_TCLK5                        1L          
#define PINMUX_PC31B_TC1_TCLK5                     ((PIN_PC31B_TC1_TCLK5 << 16) | MUX_PC31B_TC1_TCLK5)
#define PIO_PC31B_TC1_TCLK5                        (1UL << 31) 

#define PIN_PC23B_TC1_TIOA3                        87L          /**< TC1 signal: TIOA3 on PC23 mux B*/
#define MUX_PC23B_TC1_TIOA3                        1L          
#define PINMUX_PC23B_TC1_TIOA3                     ((PIN_PC23B_TC1_TIOA3 << 16) | MUX_PC23B_TC1_TIOA3)
#define PIO_PC23B_TC1_TIOA3                        (1UL << 23) 

#define PIN_PC26B_TC1_TIOA4                        90L          /**< TC1 signal: TIOA4 on PC26 mux B*/
#define MUX_PC26B_TC1_TIOA4                        1L          
#define PINMUX_PC26B_TC1_TIOA4                     ((PIN_PC26B_TC1_TIOA4 << 16) | MUX_PC26B_TC1_TIOA4)
#define PIO_PC26B_TC1_TIOA4                        (1UL << 26) 

#define PIN_PC29B_TC1_TIOA5                        93L          /**< TC1 signal: TIOA5 on PC29 mux B*/
#define MUX_PC29B_TC1_TIOA5                        1L          
#define PINMUX_PC29B_TC1_TIOA5                     ((PIN_PC29B_TC1_TIOA5 << 16) | MUX_PC29B_TC1_TIOA5)
#define PIO_PC29B_TC1_TIOA5                        (1UL << 29) 

#define PIN_PC24B_TC1_TIOB3                        88L          /**< TC1 signal: TIOB3 on PC24 mux B*/
#define MUX_PC24B_TC1_TIOB3                        1L          
#define PINMUX_PC24B_TC1_TIOB3                     ((PIN_PC24B_TC1_TIOB3 << 16) | MUX_PC24B_TC1_TIOB3)
#define PIO_PC24B_TC1_TIOB3                        (1UL << 24) 

#define PIN_PC27B_TC1_TIOB4                        91L          /**< TC1 signal: TIOB4 on PC27 mux B*/
#define MUX_PC27B_TC1_TIOB4                        1L          
#define PINMUX_PC27B_TC1_TIOB4                     ((PIN_PC27B_TC1_TIOB4 << 16) | MUX_PC27B_TC1_TIOB4)
#define PIO_PC27B_TC1_TIOB4                        (1UL << 27) 

#define PIN_PC30B_TC1_TIOB5                        94L          /**< TC1 signal: TIOB5 on PC30 mux B*/
#define MUX_PC30B_TC1_TIOB5                        1L          
#define PINMUX_PC30B_TC1_TIOB5                     ((PIN_PC30B_TC1_TIOB5 << 16) | MUX_PC30B_TC1_TIOB5)
#define PIO_PC30B_TC1_TIOB5                        (1UL << 30) 

/* ========== PIO definition for TC2 peripheral ========== */
#define PIN_PC7B_TC2_TCLK6                         71L          /**< TC2 signal: TCLK6 on PC7 mux B*/
#define MUX_PC7B_TC2_TCLK6                         1L          
#define PINMUX_PC7B_TC2_TCLK6                      ((PIN_PC7B_TC2_TCLK6 << 16) | MUX_PC7B_TC2_TCLK6)
#define PIO_PC7B_TC2_TCLK6                         (1UL << 7)  

#define PIN_PC10B_TC2_TCLK7                        74L          /**< TC2 signal: TCLK7 on PC10 mux B*/
#define MUX_PC10B_TC2_TCLK7                        1L          
#define PINMUX_PC10B_TC2_TCLK7                     ((PIN_PC10B_TC2_TCLK7 << 16) | MUX_PC10B_TC2_TCLK7)
#define PIO_PC10B_TC2_TCLK7                        (1UL << 10) 

#define PIN_PC14B_TC2_TCLK8                        78L          /**< TC2 signal: TCLK8 on PC14 mux B*/
#define MUX_PC14B_TC2_TCLK8                        1L          
#define PINMUX_PC14B_TC2_TCLK8                     ((PIN_PC14B_TC2_TCLK8 << 16) | MUX_PC14B_TC2_TCLK8)
#define PIO_PC14B_TC2_TCLK8                        (1UL << 14) 

#define PIN_PC5B_TC2_TIOA6                         69L          /**< TC2 signal: TIOA6 on PC5 mux B*/
#define MUX_PC5B_TC2_TIOA6                         1L          
#define PINMUX_PC5B_TC2_TIOA6                      ((PIN_PC5B_TC2_TIOA6 << 16) | MUX_PC5B_TC2_TIOA6)
#define PIO_PC5B_TC2_TIOA6                         (1UL << 5)  

#define PIN_PC8B_TC2_TIOA7                         72L          /**< TC2 signal: TIOA7 on PC8 mux B*/
#define MUX_PC8B_TC2_TIOA7                         1L          
#define PINMUX_PC8B_TC2_TIOA7                      ((PIN_PC8B_TC2_TIOA7 << 16) | MUX_PC8B_TC2_TIOA7)
#define PIO_PC8B_TC2_TIOA7                         (1UL << 8)  

#define PIN_PC11B_TC2_TIOA8                        75L          /**< TC2 signal: TIOA8 on PC11 mux B*/
#define MUX_PC11B_TC2_TIOA8                        1L          
#define PINMUX_PC11B_TC2_TIOA8                     ((PIN_PC11B_TC2_TIOA8 << 16) | MUX_PC11B_TC2_TIOA8)
#define PIO_PC11B_TC2_TIOA8                        (1UL << 11) 

#define PIN_PC6B_TC2_TIOB6                         70L          /**< TC2 signal: TIOB6 on PC6 mux B*/
#define MUX_PC6B_TC2_TIOB6                         1L          
#define PINMUX_PC6B_TC2_TIOB6                      ((PIN_PC6B_TC2_TIOB6 << 16) | MUX_PC6B_TC2_TIOB6)
#define PIO_PC6B_TC2_TIOB6                         (1UL << 6)  

#define PIN_PC9B_TC2_TIOB7                         73L          /**< TC2 signal: TIOB7 on PC9 mux B*/
#define MUX_PC9B_TC2_TIOB7                         1L          
#define PINMUX_PC9B_TC2_TIOB7                      ((PIN_PC9B_TC2_TIOB7 << 16) | MUX_PC9B_TC2_TIOB7)
#define PIO_PC9B_TC2_TIOB7                         (1UL << 9)  

