zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q21.h
#define PIN_PD7D_USART2_RI2                        103L         /**< USART2 signal: RI2 on PD7 mux D*/
#define MUX_PD7D_USART2_RI2                        3L          
#define PINMUX_PD7D_USART2_RI2                     ((PIN_PD7D_USART2_RI2 << 16) | MUX_PD7D_USART2_RI2)
#define PIO_PD7D_USART2_RI2                        (1UL << 7)  

#define PIN_PD18B_USART2_RTS2                      114L         /**< USART2 signal: RTS2 on PD18 mux B*/
#define MUX_PD18B_USART2_RTS2                      1L          
#define PINMUX_PD18B_USART2_RTS2                   ((PIN_PD18B_USART2_RTS2 << 16) | MUX_PD18B_USART2_RTS2)
#define PIO_PD18B_USART2_RTS2                      (1UL << 18) 

#define PIN_PD15B_USART2_RXD2                      111L         /**< USART2 signal: RXD2 on PD15 mux B*/
#define MUX_PD15B_USART2_RXD2                      1L          
#define PINMUX_PD15B_USART2_RXD2                   ((PIN_PD15B_USART2_RXD2 << 16) | MUX_PD15B_USART2_RXD2)
#define PIO_PD15B_USART2_RXD2                      (1UL << 15) 

#define PIN_PD17B_USART2_SCK2                      113L         /**< USART2 signal: SCK2 on PD17 mux B*/
#define MUX_PD17B_USART2_SCK2                      1L          
#define PINMUX_PD17B_USART2_SCK2                   ((PIN_PD17B_USART2_SCK2 << 16) | MUX_PD17B_USART2_SCK2)
#define PIO_PD17B_USART2_SCK2                      (1UL << 17) 

#define PIN_PD16B_USART2_TXD2                      112L         /**< USART2 signal: TXD2 on PD16 mux B*/
#define MUX_PD16B_USART2_TXD2                      1L          
#define PINMUX_PD16B_USART2_TXD2                   ((PIN_PD16B_USART2_TXD2 << 16) | MUX_PD16B_USART2_TXD2)
#define PIO_PD16B_USART2_TXD2                      (1UL << 16) 

/* ========== PIO definition for EBI peripheral ========== */
#define PIN_PC18A_EBI_A0                           82L          /**< EBI signal: A0 on PC18 mux A*/
#define MUX_PC18A_EBI_A0                           0L          
#define PINMUX_PC18A_EBI_A0                        ((PIN_PC18A_EBI_A0 << 16) | MUX_PC18A_EBI_A0)
#define PIO_PC18A_EBI_A0                           (1UL << 18) 

#define PIN_PC18A_EBI_NBS0                         82L          /**< EBI signal: NBS0 on PC18 mux A*/
#define MUX_PC18A_EBI_NBS0                         0L          
#define PINMUX_PC18A_EBI_NBS0                      ((PIN_PC18A_EBI_NBS0 << 16) | MUX_PC18A_EBI_NBS0)
#define PIO_PC18A_EBI_NBS0                         (1UL << 18) 

#define PIN_PC19A_EBI_A1                           83L          /**< EBI signal: A1 on PC19 mux A*/
#define MUX_PC19A_EBI_A1                           0L          
#define PINMUX_PC19A_EBI_A1                        ((PIN_PC19A_EBI_A1 << 16) | MUX_PC19A_EBI_A1)
#define PIO_PC19A_EBI_A1                           (1UL << 19) 

#define PIN_PC20A_EBI_A2                           84L          /**< EBI signal: A2 on PC20 mux A*/
#define MUX_PC20A_EBI_A2                           0L          
#define PINMUX_PC20A_EBI_A2                        ((PIN_PC20A_EBI_A2 << 16) | MUX_PC20A_EBI_A2)
#define PIO_PC20A_EBI_A2                           (1UL << 20) 

#define PIN_PC21A_EBI_A3                           85L          /**< EBI signal: A3 on PC21 mux A*/
#define MUX_PC21A_EBI_A3                           0L          
#define PINMUX_PC21A_EBI_A3                        ((PIN_PC21A_EBI_A3 << 16) | MUX_PC21A_EBI_A3)
#define PIO_PC21A_EBI_A3                           (1UL << 21) 

#define PIN_PC22A_EBI_A4                           86L          /**< EBI signal: A4 on PC22 mux A*/
#define MUX_PC22A_EBI_A4                           0L          
#define PINMUX_PC22A_EBI_A4                        ((PIN_PC22A_EBI_A4 << 16) | MUX_PC22A_EBI_A4)
#define PIO_PC22A_EBI_A4                           (1UL << 22) 

#define PIN_PC23A_EBI_A5                           87L          /**< EBI signal: A5 on PC23 mux A*/
#define MUX_PC23A_EBI_A5                           0L          
#define PINMUX_PC23A_EBI_A5                        ((PIN_PC23A_EBI_A5 << 16) | MUX_PC23A_EBI_A5)
#define PIO_PC23A_EBI_A5                           (1UL << 23) 

#define PIN_PC24A_EBI_A6                           88L          /**< EBI signal: A6 on PC24 mux A*/
#define MUX_PC24A_EBI_A6                           0L          
#define PINMUX_PC24A_EBI_A6                        ((PIN_PC24A_EBI_A6 << 16) | MUX_PC24A_EBI_A6)
#define PIO_PC24A_EBI_A6                           (1UL << 24) 

#define PIN_PC25A_EBI_A7                           89L          /**< EBI signal: A7 on PC25 mux A*/
#define MUX_PC25A_EBI_A7                           0L          
#define PINMUX_PC25A_EBI_A7                        ((PIN_PC25A_EBI_A7 << 16) | MUX_PC25A_EBI_A7)
#define PIO_PC25A_EBI_A7                           (1UL << 25) 

#define PIN_PC26A_EBI_A8                           90L          /**< EBI signal: A8 on PC26 mux A*/
#define MUX_PC26A_EBI_A8                           0L          
#define PINMUX_PC26A_EBI_A8                        ((PIN_PC26A_EBI_A8 << 16) | MUX_PC26A_EBI_A8)
#define PIO_PC26A_EBI_A8                           (1UL << 26) 

#define PIN_PC27A_EBI_A9                           91L          /**< EBI signal: A9 on PC27 mux A*/
#define MUX_PC27A_EBI_A9                           0L          
#define PINMUX_PC27A_EBI_A9                        ((PIN_PC27A_EBI_A9 << 16) | MUX_PC27A_EBI_A9)
#define PIO_PC27A_EBI_A9                           (1UL << 27) 

#define PIN_PC28A_EBI_A10                          92L          /**< EBI signal: A10 on PC28 mux A*/
#define MUX_PC28A_EBI_A10                          0L          
#define PINMUX_PC28A_EBI_A10                       ((PIN_PC28A_EBI_A10 << 16) | MUX_PC28A_EBI_A10)
#define PIO_PC28A_EBI_A10                          (1UL << 28) 

#define PIN_PC29A_EBI_A11                          93L          /**< EBI signal: A11 on PC29 mux A*/
#define MUX_PC29A_EBI_A11                          0L          
#define PINMUX_PC29A_EBI_A11                       ((PIN_PC29A_EBI_A11 << 16) | MUX_PC29A_EBI_A11)
#define PIO_PC29A_EBI_A11                          (1UL << 29) 

#define PIN_PC30A_EBI_A12                          94L          /**< EBI signal: A12 on PC30 mux A*/
#define MUX_PC30A_EBI_A12                          0L          
#define PINMUX_PC30A_EBI_A12                       ((PIN_PC30A_EBI_A12 << 16) | MUX_PC30A_EBI_A12)
#define PIO_PC30A_EBI_A12                          (1UL << 30) 

#define PIN_PC31A_EBI_A13                          95L          /**< EBI signal: A13 on PC31 mux A*/
#define MUX_PC31A_EBI_A13                          0L          
#define PINMUX_PC31A_EBI_A13                       ((PIN_PC31A_EBI_A13 << 16) | MUX_PC31A_EBI_A13)
#define PIO_PC31A_EBI_A13                          (1UL << 31) 

