zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q21.h
#define PIN_PA18C_EBI_A14                          18L          /**< EBI signal: A14 on PA18 mux C*/
#define MUX_PA18C_EBI_A14                          2L          
#define PINMUX_PA18C_EBI_A14                       ((PIN_PA18C_EBI_A14 << 16) | MUX_PA18C_EBI_A14)
#define PIO_PA18C_EBI_A14                          (1UL << 18) 

#define PIN_PA19C_EBI_A15                          19L          /**< EBI signal: A15 on PA19 mux C*/
#define MUX_PA19C_EBI_A15                          2L          
#define PINMUX_PA19C_EBI_A15                       ((PIN_PA19C_EBI_A15 << 16) | MUX_PA19C_EBI_A15)
#define PIO_PA19C_EBI_A15                          (1UL << 19) 

#define PIN_PA20C_EBI_A16                          20L          /**< EBI signal: A16 on PA20 mux C*/
#define MUX_PA20C_EBI_A16                          2L          
#define PINMUX_PA20C_EBI_A16                       ((PIN_PA20C_EBI_A16 << 16) | MUX_PA20C_EBI_A16)
#define PIO_PA20C_EBI_A16                          (1UL << 20) 

#define PIN_PA20C_EBI_BA0                          20L          /**< EBI signal: BA0 on PA20 mux C*/
#define MUX_PA20C_EBI_BA0                          2L          
#define PINMUX_PA20C_EBI_BA0                       ((PIN_PA20C_EBI_BA0 << 16) | MUX_PA20C_EBI_BA0)
#define PIO_PA20C_EBI_BA0                          (1UL << 20) 

#define PIN_PA0C_EBI_A17                           0L           /**< EBI signal: A17 on PA0 mux C*/
#define MUX_PA0C_EBI_A17                           2L          
#define PINMUX_PA0C_EBI_A17                        ((PIN_PA0C_EBI_A17 << 16) | MUX_PA0C_EBI_A17)
#define PIO_PA0C_EBI_A17                           (1UL << 0)  

#define PIN_PA0C_EBI_BA1                           0L           /**< EBI signal: BA1 on PA0 mux C*/
#define MUX_PA0C_EBI_BA1                           2L          
#define PINMUX_PA0C_EBI_BA1                        ((PIN_PA0C_EBI_BA1 << 16) | MUX_PA0C_EBI_BA1)
#define PIO_PA0C_EBI_BA1                           (1UL << 0)  

#define PIN_PA1C_EBI_A18                           1L           /**< EBI signal: A18 on PA1 mux C*/
#define MUX_PA1C_EBI_A18                           2L          
#define PINMUX_PA1C_EBI_A18                        ((PIN_PA1C_EBI_A18 << 16) | MUX_PA1C_EBI_A18)
#define PIO_PA1C_EBI_A18                           (1UL << 1)  

#define PIN_PA23C_EBI_A19                          23L          /**< EBI signal: A19 on PA23 mux C*/
#define MUX_PA23C_EBI_A19                          2L          
#define PINMUX_PA23C_EBI_A19                       ((PIN_PA23C_EBI_A19 << 16) | MUX_PA23C_EBI_A19)
#define PIO_PA23C_EBI_A19                          (1UL << 23) 

#define PIN_PA24C_EBI_A20                          24L          /**< EBI signal: A20 on PA24 mux C*/
#define MUX_PA24C_EBI_A20                          2L          
#define PINMUX_PA24C_EBI_A20                       ((PIN_PA24C_EBI_A20 << 16) | MUX_PA24C_EBI_A20)
#define PIO_PA24C_EBI_A20                          (1UL << 24) 

#define PIN_PC16A_EBI_A21                          80L          /**< EBI signal: A21 on PC16 mux A*/
#define MUX_PC16A_EBI_A21                          0L          
#define PINMUX_PC16A_EBI_A21                       ((PIN_PC16A_EBI_A21 << 16) | MUX_PC16A_EBI_A21)
#define PIO_PC16A_EBI_A21                          (1UL << 16) 

#define PIN_PC16A_EBI_NANDALE                      80L          /**< EBI signal: NANDALE on PC16 mux A*/
#define MUX_PC16A_EBI_NANDALE                      0L          
#define PINMUX_PC16A_EBI_NANDALE                   ((PIN_PC16A_EBI_NANDALE << 16) | MUX_PC16A_EBI_NANDALE)
#define PIO_PC16A_EBI_NANDALE                      (1UL << 16) 

#define PIN_PC17A_EBI_A22                          81L          /**< EBI signal: A22 on PC17 mux A*/
#define MUX_PC17A_EBI_A22                          0L          
#define PINMUX_PC17A_EBI_A22                       ((PIN_PC17A_EBI_A22 << 16) | MUX_PC17A_EBI_A22)
#define PIO_PC17A_EBI_A22                          (1UL << 17) 

#define PIN_PC17A_EBI_NANDCLE                      81L          /**< EBI signal: NANDCLE on PC17 mux A*/
#define MUX_PC17A_EBI_NANDCLE                      0L          
#define PINMUX_PC17A_EBI_NANDCLE                   ((PIN_PC17A_EBI_NANDCLE << 16) | MUX_PC17A_EBI_NANDCLE)
#define PIO_PC17A_EBI_NANDCLE                      (1UL << 17) 

#define PIN_PA25C_EBI_A23                          25L          /**< EBI signal: A23 on PA25 mux C*/
#define MUX_PA25C_EBI_A23                          2L          
#define PINMUX_PA25C_EBI_A23                       ((PIN_PA25C_EBI_A23 << 16) | MUX_PA25C_EBI_A23)
#define PIO_PA25C_EBI_A23                          (1UL << 25) 

#define PIN_PD17C_EBI_CAS                          113L         /**< EBI signal: CAS on PD17 mux C*/
#define MUX_PD17C_EBI_CAS                          2L          
#define PINMUX_PD17C_EBI_CAS                       ((PIN_PD17C_EBI_CAS << 16) | MUX_PD17C_EBI_CAS)
#define PIO_PD17C_EBI_CAS                          (1UL << 17) 

#define PIN_PC0A_EBI_D0                            64L          /**< EBI signal: D0 on PC0 mux A*/
#define MUX_PC0A_EBI_D0                            0L          
#define PINMUX_PC0A_EBI_D0                         ((PIN_PC0A_EBI_D0 << 16) | MUX_PC0A_EBI_D0)
#define PIO_PC0A_EBI_D0                            (1UL << 0)  

#define PIN_PC1A_EBI_D1                            65L          /**< EBI signal: D1 on PC1 mux A*/
#define MUX_PC1A_EBI_D1                            0L          
#define PINMUX_PC1A_EBI_D1                         ((PIN_PC1A_EBI_D1 << 16) | MUX_PC1A_EBI_D1)
#define PIO_PC1A_EBI_D1                            (1UL << 1)  

#define PIN_PC2A_EBI_D2                            66L          /**< EBI signal: D2 on PC2 mux A*/
#define MUX_PC2A_EBI_D2                            0L          
#define PINMUX_PC2A_EBI_D2                         ((PIN_PC2A_EBI_D2 << 16) | MUX_PC2A_EBI_D2)
#define PIO_PC2A_EBI_D2                            (1UL << 2)  

#define PIN_PC3A_EBI_D3                            67L          /**< EBI signal: D3 on PC3 mux A*/
#define MUX_PC3A_EBI_D3                            0L          
#define PINMUX_PC3A_EBI_D3                         ((PIN_PC3A_EBI_D3 << 16) | MUX_PC3A_EBI_D3)
#define PIO_PC3A_EBI_D3                            (1UL << 3)  

#define PIN_PC4A_EBI_D4                            68L          /**< EBI signal: D4 on PC4 mux A*/
#define MUX_PC4A_EBI_D4                            0L          
#define PINMUX_PC4A_EBI_D4                         ((PIN_PC4A_EBI_D4 << 16) | MUX_PC4A_EBI_D4)
#define PIO_PC4A_EBI_D4                            (1UL << 4)  

#define PIN_PC5A_EBI_D5                            69L          /**< EBI signal: D5 on PC5 mux A*/
#define MUX_PC5A_EBI_D5                            0L          
#define PINMUX_PC5A_EBI_D5                         ((PIN_PC5A_EBI_D5 << 16) | MUX_PC5A_EBI_D5)
#define PIO_PC5A_EBI_D5                            (1UL << 5)  

