zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/pio/same70q21.h
#define PIN_PC6A_EBI_D6                            70L          /**< EBI signal: D6 on PC6 mux A*/
#define MUX_PC6A_EBI_D6                            0L          
#define PINMUX_PC6A_EBI_D6                         ((PIN_PC6A_EBI_D6 << 16) | MUX_PC6A_EBI_D6)
#define PIO_PC6A_EBI_D6                            (1UL << 6)  

#define PIN_PC7A_EBI_D7                            71L          /**< EBI signal: D7 on PC7 mux A*/
#define MUX_PC7A_EBI_D7                            0L          
#define PINMUX_PC7A_EBI_D7                         ((PIN_PC7A_EBI_D7 << 16) | MUX_PC7A_EBI_D7)
#define PIO_PC7A_EBI_D7                            (1UL << 7)  

#define PIN_PE0A_EBI_D8                            128L         /**< EBI signal: D8 on PE0 mux A*/
#define MUX_PE0A_EBI_D8                            0L          
#define PINMUX_PE0A_EBI_D8                         ((PIN_PE0A_EBI_D8 << 16) | MUX_PE0A_EBI_D8)
#define PIO_PE0A_EBI_D8                            (1UL << 0)  

#define PIN_PE1A_EBI_D9                            129L         /**< EBI signal: D9 on PE1 mux A*/
#define MUX_PE1A_EBI_D9                            0L          
#define PINMUX_PE1A_EBI_D9                         ((PIN_PE1A_EBI_D9 << 16) | MUX_PE1A_EBI_D9)
#define PIO_PE1A_EBI_D9                            (1UL << 1)  

#define PIN_PE2A_EBI_D10                           130L         /**< EBI signal: D10 on PE2 mux A*/
#define MUX_PE2A_EBI_D10                           0L          
#define PINMUX_PE2A_EBI_D10                        ((PIN_PE2A_EBI_D10 << 16) | MUX_PE2A_EBI_D10)
#define PIO_PE2A_EBI_D10                           (1UL << 2)  

#define PIN_PE3A_EBI_D11                           131L         /**< EBI signal: D11 on PE3 mux A*/
#define MUX_PE3A_EBI_D11                           0L          
#define PINMUX_PE3A_EBI_D11                        ((PIN_PE3A_EBI_D11 << 16) | MUX_PE3A_EBI_D11)
#define PIO_PE3A_EBI_D11                           (1UL << 3)  

#define PIN_PE4A_EBI_D12                           132L         /**< EBI signal: D12 on PE4 mux A*/
#define MUX_PE4A_EBI_D12                           0L          
#define PINMUX_PE4A_EBI_D12                        ((PIN_PE4A_EBI_D12 << 16) | MUX_PE4A_EBI_D12)
#define PIO_PE4A_EBI_D12                           (1UL << 4)  

#define PIN_PE5A_EBI_D13                           133L         /**< EBI signal: D13 on PE5 mux A*/
#define MUX_PE5A_EBI_D13                           0L          
#define PINMUX_PE5A_EBI_D13                        ((PIN_PE5A_EBI_D13 << 16) | MUX_PE5A_EBI_D13)
#define PIO_PE5A_EBI_D13                           (1UL << 5)  

#define PIN_PA15A_EBI_D14                          15L          /**< EBI signal: D14 on PA15 mux A*/
#define MUX_PA15A_EBI_D14                          0L          
#define PINMUX_PA15A_EBI_D14                       ((PIN_PA15A_EBI_D14 << 16) | MUX_PA15A_EBI_D14)
#define PIO_PA15A_EBI_D14                          (1UL << 15) 

#define PIN_PA16A_EBI_D15                          16L          /**< EBI signal: D15 on PA16 mux A*/
#define MUX_PA16A_EBI_D15                          0L          
#define PINMUX_PA16A_EBI_D15                       ((PIN_PA16A_EBI_D15 << 16) | MUX_PA16A_EBI_D15)
#define PIO_PA16A_EBI_D15                          (1UL << 16) 

#define PIN_PC9A_EBI_NANDOE                        73L          /**< EBI signal: NANDOE on PC9 mux A*/
#define MUX_PC9A_EBI_NANDOE                        0L          
#define PINMUX_PC9A_EBI_NANDOE                     ((PIN_PC9A_EBI_NANDOE << 16) | MUX_PC9A_EBI_NANDOE)
#define PIO_PC9A_EBI_NANDOE                        (1UL << 9)  

#define PIN_PC10A_EBI_NANDWE                       74L          /**< EBI signal: NANDWE on PC10 mux A*/
#define MUX_PC10A_EBI_NANDWE                       0L          
#define PINMUX_PC10A_EBI_NANDWE                    ((PIN_PC10A_EBI_NANDWE << 16) | MUX_PC10A_EBI_NANDWE)
#define PIO_PC10A_EBI_NANDWE                       (1UL << 10) 

#define PIN_PC14A_EBI_NCS0                         78L          /**< EBI signal: NCS0 on PC14 mux A*/
#define MUX_PC14A_EBI_NCS0                         0L          
#define PINMUX_PC14A_EBI_NCS0                      ((PIN_PC14A_EBI_NCS0 << 16) | MUX_PC14A_EBI_NCS0)
#define PIO_PC14A_EBI_NCS0                         (1UL << 14) 

#define PIN_PC15A_EBI_NCS1                         79L          /**< EBI signal: NCS1 on PC15 mux A*/
#define MUX_PC15A_EBI_NCS1                         0L          
#define PINMUX_PC15A_EBI_NCS1                      ((PIN_PC15A_EBI_NCS1 << 16) | MUX_PC15A_EBI_NCS1)
#define PIO_PC15A_EBI_NCS1                         (1UL << 15) 

#define PIN_PC15A_EBI_SDCS                         79L          /**< EBI signal: SDCS on PC15 mux A*/
#define MUX_PC15A_EBI_SDCS                         0L          
#define PINMUX_PC15A_EBI_SDCS                      ((PIN_PC15A_EBI_SDCS << 16) | MUX_PC15A_EBI_SDCS)
#define PIO_PC15A_EBI_SDCS                         (1UL << 15) 

#define PIN_PD18A_EBI_NCS1                         114L         /**< EBI signal: NCS1 on PD18 mux A*/
#define MUX_PD18A_EBI_NCS1                         0L          
#define PINMUX_PD18A_EBI_NCS1                      ((PIN_PD18A_EBI_NCS1 << 16) | MUX_PD18A_EBI_NCS1)
#define PIO_PD18A_EBI_NCS1                         (1UL << 18) 

#define PIN_PD18A_EBI_SDCS                         114L         /**< EBI signal: SDCS on PD18 mux A*/
#define MUX_PD18A_EBI_SDCS                         0L          
#define PINMUX_PD18A_EBI_SDCS                      ((PIN_PD18A_EBI_SDCS << 16) | MUX_PD18A_EBI_SDCS)
#define PIO_PD18A_EBI_SDCS                         (1UL << 18) 

#define PIN_PA22C_EBI_NCS2                         22L          /**< EBI signal: NCS2 on PA22 mux C*/
#define MUX_PA22C_EBI_NCS2                         2L          
#define PINMUX_PA22C_EBI_NCS2                      ((PIN_PA22C_EBI_NCS2 << 16) | MUX_PA22C_EBI_NCS2)
#define PIO_PA22C_EBI_NCS2                         (1UL << 22) 

#define PIN_PC12A_EBI_NCS3                         76L          /**< EBI signal: NCS3 on PC12 mux A*/
#define MUX_PC12A_EBI_NCS3                         0L          
#define PINMUX_PC12A_EBI_NCS3                      ((PIN_PC12A_EBI_NCS3 << 16) | MUX_PC12A_EBI_NCS3)
#define PIO_PC12A_EBI_NCS3                         (1UL << 12) 

#define PIN_PD19A_EBI_NCS3                         115L         /**< EBI signal: NCS3 on PD19 mux A*/
#define MUX_PD19A_EBI_NCS3                         0L          
#define PINMUX_PD19A_EBI_NCS3                      ((PIN_PD19A_EBI_NCS3 << 16) | MUX_PD19A_EBI_NCS3)
#define PIO_PD19A_EBI_NCS3                         (1UL << 19) 

#define PIN_PC11A_EBI_NRD                          75L          /**< EBI signal: NRD on PC11 mux A*/
#define MUX_PC11A_EBI_NRD                          0L          
#define PINMUX_PC11A_EBI_NRD                       ((PIN_PC11A_EBI_NRD << 16) | MUX_PC11A_EBI_NRD)
#define PIO_PC11A_EBI_NRD                          (1UL << 11) 

#define PIN_PC13A_EBI_NWAIT                        77L          /**< EBI signal: NWAIT on PC13 mux A*/
#define MUX_PC13A_EBI_NWAIT                        0L          
#define PINMUX_PC13A_EBI_NWAIT                     ((PIN_PC13A_EBI_NWAIT << 16) | MUX_PC13A_EBI_NWAIT)
#define PIO_PC13A_EBI_NWAIT                        (1UL << 13) 

#define PIN_PC8A_EBI_NWR0                          72L          /**< EBI signal: NWR0 on PC8 mux A*/
#define MUX_PC8A_EBI_NWR0                          0L          
#define PINMUX_PC8A_EBI_NWR0                       ((PIN_PC8A_EBI_NWR0 << 16) | MUX_PC8A_EBI_NWR0)
#define PIO_PC8A_EBI_NWR0                          (1UL << 8)  

#define PIN_PC8A_EBI_NWE                           72L          /**< EBI signal: NWE on PC8 mux A*/
#define MUX_PC8A_EBI_NWE                           0L          
#define PINMUX_PC8A_EBI_NWE                        ((PIN_PC8A_EBI_NWE << 16) | MUX_PC8A_EBI_NWE)
#define PIO_PC8A_EBI_NWE                           (1UL << 8)  

#define PIN_PD15C_EBI_NWR1                         111L         /**< EBI signal: NWR1 on PD15 mux C*/
#define MUX_PD15C_EBI_NWR1                         2L          
#define PINMUX_PD15C_EBI_NWR1                      ((PIN_PD15C_EBI_NWR1 << 16) | MUX_PD15C_EBI_NWR1)
#define PIO_PD15C_EBI_NWR1                         (1UL << 15) 

